
nsh> [K
nsh> [K
nsh> [K
nsh> [Kflappi[King stop
flapping: exiting.
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 11100111, 231, 0.47, 0.93, (-100000.0000000)
P 1: 00101011,  43, 0.73, 0.13, (-100000.0000000)
P 2: 11101101, 237, 0.87, 0.93, (-100000.0000000)
P 3: 00001001,   9, 0.60, 0.00, (-100000.0000000)
P 4: 11000011, 195, 0.20, 0.80, (-100000.0000000)
P 5: 10100011, 163, 0.20, 0.67, (-100000.0000000)
---------------------------------------------
nsh> [K(-65.24)
T 1: 00101011,  43, 0.73, 0.13, (-60.55)
T 2: 11101101, 237, 0.87, 0.93, 
nsh> [K
nsh> [K
nsh> [K
nsh> [Kstop[K[K[K[Kflapping stop
nsh> [Kflapping: exiting.
flapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00101101,  45, 0.87, 0.13, (-100000.0000000)
P 1: 01101000, 104, 0.53, 0.40, (-100000.0000000)
P 2: 01111001, 121, 0.60, 0.47, (-100000.0000000)
P 3: 10001010, 138, 0.67, 0.53, (-100000.0000000)
P 4: 01101001, 105, 0.60, 0.40, (-100000.0000000)
P 5: 01010100,  84, 0.27, 0.33, (-100000.0000000)
---------------------------------------------
nsh> [K(-61.93)
T 1: 01101000, 104, 0.53, 0.40, (-62.42)
T 2: 01111001, 121, 0.60, 0.47, (-63.16)
T 3: 10001010, 138, 0.67, 0.53, (-63.01)
T 4: 01101001, 105, 0.60, 0.40, (-63.13)
T 5: 01010100,  84, 0.27, 0.33, (-63.97)
*********************************************

G: 1
BEST TRANS-GENERATION
00101101,  45, 0.87, 0.13 (-61.93)
*********************************************
P 0: 00101101,  45, 0.87, 0.13, (-61.93)
P 1: 01101000, 104, 0.53, 0.40, (-62.42)
P 2: 10001010, 138, 0.67, 0.53, (-63.01)
P 3: 01101001, 105, 0.60, 0.40, (-63.13)
P 4: 01111001, 121, 0.60, 0.47, (-63.16)
P 5: 01010100,  84, 0.27, 0.33, (-63.97)
---------------------------------------------
T 0: 00101000,  40, 0.53, 0.13, (-59.69)
T 1: 00101101,  45, 0.87, 0.13, (-60.41)
T 2: 00101101,  45, 0.87, 0.13, (-61.03)
T 3: 01101001, 105, 0.60, 0.40, (-62.63)
T 4: 00101101,  45, 0.87, 0.13, (-60.16)
T 5: 00101101,  45, 0.87, 0.13, (-60.25)
*********************************************

G: 2
BEST TRANS-GENERATION
00101000,  40, 0.53, 0.13 (-59.69)
*********************************************
P 0: 00101000,  40, 0.53, 0.13, (-59.69)
P 1: 00101101,  45, 0.87, 0.13, (-60.16)
P 2: 00101101,  45, 0.87, 0.13, (-60.25)
P 3: 00101101,  45, 0.87, 0.13, (-60.41)
P 4: 00101101,  45, 0.87, 0.13, (-61.03)
P 5: 01101001, 105, 0.60, 0.40, (-62.63)
---------------------------------------------
T 0: 00101101,  45, 0.87, 0.13, (-60.44)
T 1: 00101101,  45, 0.87, 0.13, (-60.14)
T 2: 00101101,  45, 0.87, 0.13, (-60.65)
T 3: 00101111,  47, 1.00, 0.13, (-59.72)
T 4: 00111101,  61, 0.87, 0.20, (-60.82)
T 5: 01101101, 109, 0.87, 0.40, (-61.27)
*********************************************

G: 3
BEST TRANS-GENERATION
00101000,  40, 0.53, 0.13 (-59.69)
*********************************************
P 0: 00101111,  47, 1.00, 0.13, (-59.72)
P 1: 00101101,  45, 0.87, 0.13, (-60.14)
P 2: 00101101,  45, 0.87, 0.13, (-60.44)
P 3: 00101101,  45, 0.87, 0.13, (-60.65)
P 4: 00111101,  61, 0.87, 0.20, (-60.82)
P 5: 01101101, 109, 0.87, 0.40, (-61.27)
---------------------------------------------
T 0: 00101111,  47, 1.00, 0.13, (-60.71)
T 1: 00101111,  47, 1.00, 0.13, (-60.01)
T 2: 00111100,  60, 0.80, 0.20, (-60.84)
T 3: 00101111,  47, 1.00, 0.13, (-58.25)
T 4: 00101111,  47, 1.00, 0.13, (-60.35)
T 5: 00101101,  45, 0.87, 0.13, (-61.33)
*********************************************

G: 4
BEST TRANS-GENERATION
00101111,  47, 1.00, 0.13 (-58.25)
*********************************************
P 0: 00101111,  47, 1.00, 0.13, (-58.25)
P 1: 00101111,  47, 1.00, 0.13, (-60.01)
P 2: 00101111,  47, 1.00, 0.13, (-60.35)
P 3: 00101111,  47, 1.00, 0.13, (-60.71)
P 4: 00111100,  60, 0.80, 0.20, (-60.84)
P 5: 00101101,  45, 0.87, 0.13, (-61.33)
---------------------------------------------
T 0: 00101111,  47, 1.00, 0.13, (-60.85)
T 1: 00101100,  44, 0.80, 0.13, (-60.26)
T 2: 00101100,  44, 0.80, 0.13, (-59.96)
T 3: 00101001,  41, 0.60, 0.13, (-60.39)
T 4: 00101110,  46, 0.93, 0.13, (-61.28)
T 5: 00101111,  47, 1.00, 0.13, (-59.97)
*********************************************

G: 5
BEST TRANS-GENERATION
00101111,  47, 1.00, 0.13 (-58.25)
*********************************************
P 0: 00101100,  44, 0.80, 0.13, (-59.96)
P 1: 00101111,  47, 1.00, 0.13, (-59.97)
P 2: 00101100,  44, 0.80, 0.13, (-60.26)
P 3: 00101001,  41, 0.60, 0.13, (-60.39)
P 4: 00101111,  47, 1.00, 0.13, (-60.85)
P 5: 00101110,  46, 0.93, 0.13, (-61.28)
---------------------------------------------
T 0: 00001101,  13, 0.87, 0.00, (-58.72)
T 1: 00001001,   9, 0.60, 0.00, (-59.91)
T 2: 00001101,  13, 0.87, 0.00, (-59.90)
T 3: 00000001,   1, 0.07, 0.00, (-57.23)
T 4: 00001001,   9, 0.60, 0.00, (-59.03)
T 5: 00001001,   9, 0.60, 0.00, (-58.99)
*********************************************

G: 6
BEST TRANS-GENERATION
00000001,   1, 0.07, 0.00 (-57.23)
*********************************************
P 0: 00000001,   1, 0.07, 0.00, (-57.23)
P 1: 00001101,  13, 0.87, 0.00, (-58.72)
P 2: 00001001,   9, 0.60, 0.00, (-58.99)
P 3: 00001001,   9, 0.60, 0.00, (-59.03)
P 4: 00001101,  13, 0.87, 0.00, (-59.90)
P 5: 00001001,   9, 0.60, 0.00, (-59.91)
---------------------------------------------
T 0: 00000101,   5, 0.33, 0.00, (-59.66)
T 1: 00001101,  13, 0.87, 0.00, (-59.68)
T 2: 00000101,   5, 0.33, 0.00, (-59.29)
T 3: 10000111, 135, 0.47, 0.53, (-63.54)
T 4: 00001100,  12, 0.80, 0.00, (-58.05)
T 5: 00001101,  13, 0.87, 0.00, (-58.91)
*********************************************

G: 7
BEST TRANS-GENERATION
00000001,   1, 0.07, 0.00 (-57.23)
*********************************************
P 0: 00001100,  12, 0.80, 0.00, (-58.05)
P 1: 00001101,  13, 0.87, 0.00, (-58.91)
P 2: 00000101,   5, 0.33, 0.00, (-59.29)
P 3: 00000101,   5, 0.33, 0.00, (-59.66)
P 4: 00001101,  13, 0.87, 0.00, (-59.68)
P 5: 10000111, 135, 0.47, 0.53, (-63.54)
---------------------------------------------
T 0: 00001100,  12, 0.80, 0.00, (-58.91)
T 1: 00001100,  12, 0.80, 0.00, (-58.77)
T 2: 00001100,  12, 0.80, 0.00, (-59.72)
T 3: 00001100,  12, 0.80, 0.00, (-59.00)
T 4: 00001100,  12, 0.80, 0.00, (-59.56)
T 5: 00001100,  12, 0.80, 0.00, (-61.42)
*********************************************

G: 8
BEST TRANS-GENERATION
00000001,   1, 0.07, 0.00 (-57.23)
*********************************************
P 0: 00001100,  12, 0.80, 0.00, (-58.77)
P 1: 00001100,  12, 0.80, 0.00, (-58.91)
P 2: 00001100,  12, 0.80, 0.00, (-59.00)
P 3: 00001100,  12, 0.80, 0.00, (-59.56)
P 4: 00001100,  12, 0.80, 0.00, (-59.72)
P 5: 00001100,  12, 0.80, 0.00, (-61.42)
---------------------------------------------
T 0: 01001100,  76, 0.80, 0.27, (-61.29)
T 1: 00001100,  12, 0.80, 0.00, (-59.81)
T 2: 01001100,  76, 0.80, 0.27, (-62.19)
T 3: 00001001,   9, 0.60, 0.00, (-59.04)
T 4: 01001100,  76, 0.80, 0.27, (-61.69)
T 5: 01001000,  72, 0.53, 0.27, (-62.57)
*********************************************

G: 9
BEST TRANS-GENERATION
00000001,   1, 0.07, 0.00 (-57.23)
*********************************************
P 0: 00001001,   9, 0.60, 0.00, (-59.04)
P 1: 00001100,  12, 0.80, 0.00, (-59.81)
P 2: 01001100,  76, 0.80, 0.27, (-61.29)
P 3: 01001100,  76, 0.80, 0.27, (-61.69)
P 4: 01001100,  76, 0.80, 0.27, (-62.19)
P 5: 01001000,  72, 0.53, 0.27, (-62.57)
---------------------------------------------
T 0: 00001100,  12, 0.80, 0.00, (-59.97)
T 1: 00001110,  14, 0.93, 0.00, (-59.60)
T 2: 00001100,  12, 0.80, 0.00, (-59.95)
T 3: 00001110,  14, 0.93, 0.00, (-59.53)
T 4: 00001100,  12, 0.80, 0.00, (-59.81)
T 5: 00001010,  10, 0.67, 0.00, (-58.59)
*********************************************

G: 10
BEST TRANS-GENERATION
00000001,   1, 0.07, 0.00 (-57.23)
*********************************************
P 0: 00001010,  10, 0.67, 0.00, (-58.59)
P 1: 00001110,  14, 0.93, 0.00, (-59.53)
P 2: 00001110,  14, 0.93, 0.00, (-59.60)
P 3: 00001100,  12, 0.80, 0.00, (-59.81)
P 4: 00001100,  12, 0.80, 0.00, (-59.95)
P 5: 00001100,  12, 0.80, 0.00, (-59.97)
---------------------------------------------
T 0: 10000110, 134, 0.40, 0.53, (-64.60)
T 1: 00001110,  14, 0.93, 0.00, (-60.000)
T 2: 10000110, 134, 0.40, 0.53, (-64.35)
T 3: 10000110, 134, 0.40, 0.53, (-65.66)
T 4: 00001110,  14, 0.93, 0.00, (-60.38)
T 5: 00000111,   7, 0.47, 0.00, (-59.48)
*********************************************

G: 11
BEST TRANS-GENERATION
00000001,   1, 0.07, 0.00 (-57.23)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (-59.48)
P 1: 00001110,  14, 0.93, 0.00, (-60.000)
P 2: 00001110,  14, 0.93, 0.00, (-60.38)
P 3: 10000110, 134, 0.40, 0.53, (-64.35)
P 4: 10000110, 134, 0.40, 0.53, (-64.60)
P 5: 10000110, 134, 0.40, 0.53, (-65.66)
---------------------------------------------
T 0: 00001110,  14, 0.93, 0.00, (-58.89)
T 1: 00001100,  12, 0.80, 0.00, (-59.75)
T 2: 00000110,   6, 0.40, 0.00, (-59.35)
T 3: 00001110,  14, 0.93, 0.00, (-60.15)
T 4: 00000100,   4, 0.27, 0.00, (-59.40)
T 5: 00000110,   6, 0.40, 0.00, (-59.39)
*********************************************

G: 12
BEST TRANS-GENERATION
00000001,   1, 0.07, 0.00 (-57.23)
*********************************************
P 0: 00001110,  14, 0.93, 0.00, (-58.89)
P 1: 00000110,   6, 0.40, 0.00, (-59.35)
P 2: 00000110,   6, 0.40, 0.00, (-59.39)
P 3: 00000100,   4, 0.27, 0.00, (-59.40)
P 4: 00001100,  12, 0.80, 0.00, (-59.75)
P 5: 00001110,  14, 0.93, 0.00, (-60.15)
---------------------------------------------
T 0: 00000110,   6, 0.40, 0.00, ! 
nsh: !: command not found
nsh> [K
nsh> [K
nsh> [Kreboot -b

nsh> [K
nsh> [K
nsh> [K
nsh> [Kflapping stop
nsh> [Kflappint [K[Kg start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (-100000.0000000)
P 1: 01111100, 124, 0.80, 0.47, (-100000.0000000)
P 2: 01001110,  78, 0.93, 0.27, (-100000.0000000)
P 3: 11011000, 216, 0.53, 0.87, (-100000.0000000)
P 4: 00010000,  16, 0.00, 0.07, (-100000.0000000)
P 5: 00101000,  40, 0.53, 0.13, (-100000.0000000)
---------------------------------------------
nsh> [Kflapping stop
flapping: exiting.
nsh> [Kflappint [K[Kg start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 11100111, 231, 0.47, 0.93, (-100000.0000000)
P 1: 00101011,  43, 0.73, 0.13, (-100000.0000000)
P 2: 11101101, 237, 0.87, 0.93, (-100000.0000000)
P 3: 00001001,   9, 0.60, 0.00, (-100000.0000000)
P 4: 11000011, 195, 0.20, 0.80, (-100000.0000000)
P 5: 10100011, 163, 0.20, 0.67, (-100000.0000000)
---------------------------------------------
nsh> [K(0.38)
T 1: 00101011,  43, 0.73, 0.13, (0.62)
T 2: 11101101, 237, 0.87, 0.93, 
nsh> [K
nsh> [Kflapping stop
flapping: exiting.
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00101101,  45, 0.87, 0.13, (-100000.0000000)
P 1: 01101000, 104, 0.53, 0.40, (-100000.0000000)
P 2: 01111001, 121, 0.60, 0.47, (-100000.0000000)
P 3: 10001010, 138, 0.67, 0.53, (-100000.0000000)
P 4: 01101001, 105, 0.60, 0.40, (-100000.0000000)
P 5: 01010100,  84, 0.27, 0.33, (-100000.0000000)
---------------------------------------------
nsh> [K(0.60)
T 1: 01101000, 104, 0.53, 0.40, (0.51)
T 2: 01111001, 121, 0.60, 0.47, (0.53)
T 3: 10001010, 138, 0.67, 0.53, (0.53)
T 4: 01101001, 105, 0.60, 0.40, (0.53)
T 5: 01010100,  84, 0.27, 0.33, (0.44)
*********************************************

G: 1
BEST TRANS-GENERATION
00101101,  45, 0.87, 0.13 (0.60)
*********************************************
P 0: 00101101,  45, 0.87, 0.13, (0.60)
P 1: 10001010, 138, 0.67, 0.53, (0.53)
P 2: 01101001, 105, 0.60, 0.40, (0.53)
P 3: 01111001, 121, 0.60, 0.47, (0.53)
P 4: 01101000, 104, 0.53, 0.40, (0.51)
P 5: 01010100,  84, 0.27, 0.33, (0.44)
---------------------------------------------
T 0: 00101010,  42, 0.67, 0.13, (0.62)
T 1: 00101101,  45, 0.87, 0.13, (0.62)
T 2: 00101101,  45, 0.87, 0.13, (0.61)
T 3: 10001001, 137, 0.60, 0.53, (0.52)
T 4: 00101101,  45, 0.87, 0.13, (0.61)
T 5: 00101101,  45, 0.87, 0.13, (0.60)
*********************************************

G: 2
BEST TRANS-GENERATION
00101101,  45, 0.87, 0.13 (0.62)
*********************************************
P 0: 00101101,  45, 0.87, 0.13, (0.62)
P 1: 00101010,  42, 0.67, 0.13, (0.62)
P 2: 00101101,  45, 0.87, 0.13, (0.61)
P 3: 00101101,  45, 0.87, 0.13, (0.61)
P 4: 00101101,  45, 0.87, 0.13, (0.60)
P 5: 10001001, 137, 0.60, 0.53, (0.52)
---------------------------------------------
T 0: 00101010,  42, 0.67, 0.13, (0.61)
T 1: 00101110,  46, 0.93, 0.13, (0.60)
T 2: 00101110,  46, 0.93, 0.13, (0.59)
T 3: 00101000,  40, 0.53, 0.13, (0.57)
T 4: 00111110,  62, 0.93, 0.20, (0.57)
T 5: 01101110, 110, 0.93, 0.40, (0.54)
*********************************************

G: 3
BEST TRANS-GENERATION
00101101,  45, 0.87, 0.13 (0.62)
*********************************************
P 0: 00101010,  42, 0.67, 0.13, (0.61)
P 1: 00101110,  46, 0.93, 0.13, (0.60)
P 2: 00101110,  46, 0.93, 0.13, (0.59)
P 3: 00111110,  62, 0.93, 0.20, (0.57)
P 4: 00101000,  40, 0.53, 0.13, (0.57)
P 5: 01101110, 110, 0.93, 0.40, (0.54)
---------------------------------------------
T 0: 00101010,  42, 0.67, 0.13, (0.61)
T 1: 00101010,  42, 0.67, 0.13, (0.61)
T 2: 00111111,  63, 1.00, 0.20, (0.56)
T 3: 00101010,  42, 0.67, 0.13, (0.62)
T 4: 00101010,  42, 0.67, 0.13, (0.61)
T 5: 00101000,  40, 0.53, 0.13, (0.57)
*********************************************

G: 4
BEST TRANS-GENERATION
00101101,  45, 0.87, 0.13 (0.62)
*********************************************
P 0: 00101010,  42, 0.67, 0.13, (0.62)
P 1: 00101010,  42, 0.67, 0.13, (0.61)
P 2: 00101010,  42, 0.67, 0.13, (0.61)
P 3: 00101010,  42, 0.67, 0.13, (0.61)
P 4: 00101000,  40, 0.53, 0.13, (0.57)
P 5: 00111111,  63, 1.00, 0.20, (0.56)
---------------------------------------------
T 0: 00101010,  42, 0.67, 0.13, (0.61)
T 1: 00101001,  41, 0.60, 0.13, (0.60)
T 2: 00101001,  41, 0.60, 0.13, (0.58)
T 3: 00101100,  44, 0.80, 0.13, (0.64)
T 4: 00101011,  43, 0.73, 0.13, (0.62)
T 5: 00101010,  42, 0.67, 0.13, (0.60)
*********************************************

G: 5
BEST TRANS-GENERATION
00101100,  44, 0.80, 0.13 (0.64)
*********************************************
P 0: 00101100,  44, 0.80, 0.13, (0.64)
P 1: 00101011,  43, 0.73, 0.13, (0.62)
P 2: 00101010,  42, 0.67, 0.13, (0.61)
P 3: 00101010,  42, 0.67, 0.13, (0.60)
P 4: 00101001,  41, 0.60, 0.13, (0.60)
P 5: 00101001,  41, 0.60, 0.13, (0.58)
---------------------------------------------
T 0: 00001101,  13, 0.87, 0.00, (0.65)
T 1: 00001001,   9, 0.60, 0.00, (0.61)
T 2: 00001101,  13, 0.87, 0.00, (0.64)
T 3: 00000001,   1, 0.07, 0.00, (0.44)
T 4: 00001001,   9, 0.60, 0.00, (0.61)
T 5: 00001001,   9, 0.60, 0.00, (0.61)
*********************************************

G: 6
BEST TRANS-GENERATION
00001101,  13, 0.87, 0.00 (0.65)
*********************************************
P 0: 00001101,  13, 0.87, 0.00, (0.65)
P 1: 00001101,  13, 0.87, 0.00, (0.64)
P 2: 00001001,   9, 0.60, 0.00, (0.61)
P 3: 00001001,   9, 0.60, 0.00, (0.61)
P 4: 00001001,   9, 0.60, 0.00, (0.61)
P 5: 00000001,   1, 0.07, 0.00, (0.44)
---------------------------------------------
T 0: 00001101,  13, 0.87, 0.00, (0.64)
T 1: 00001101,  13, 0.87, 0.00, (0.64)
T 2: 00000101,   5, 0.33, 0.00, (0.53)
T 3: 10001111, 143, 1.00, 0.53, (0.50)
T 4: 00001100,  12, 0.80, 0.00, (0.67)
T 5: 00001101,  13, 0.87, 0.00, (0.63)
*********************************************

G: 7
BEST TRANS-GENERATION
00001100,  12, 0.80, 0.00 (0.67)
*********************************************
P 0: 00001100,  12, 0.80, 0.00, (0.67)
P 1: 00001101,  13, 0.87, 0.00, (0.64)
P 2: 00001101,  13, 0.87, 0.00, (0.64)
P 3: 00001101,  13, 0.87, 0.00, (0.63)
P 4: 00000101,   5, 0.33, 0.00, (0.53)
P 5: 10001111, 143, 1.00, 0.53, (0.50)
---------------------------------------------
T 0: 00001100,  12, 0.80, 0.00, (0.67)
T 1: 00001100,  12, 0.80, 0.00, 
nsh> [Kflapping stop
flapping: exiting.
nsh> [Kreboot

nsh> [K
nsh> [K
nsh> [K flapping stop
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (-100000.0000000)
P 1: 01111100, 124, 0.80, 0.47, (-100000.0000000)
P 2: 01001110,  78, 0.93, 0.27, (-100000.0000000)
P 3: 11011000, 216, 0.53, 0.87, (-100000.0000000)
P 4: 00010000,  16, 0.00, 0.07, (-100000.0000000)
P 5: 00101000,  40, 0.53, 0.13, (-100000.0000000)
---------------------------------------------
nsh> [K(0.00)
T 1: 01111100, 124, 0.80, 0.47, (0.00)
T 2: 01001110,  78, 0.93, 0.27, (0.00)
T 3: 11011000, 216, 0.53, 0.87, (0.00)
T 4: 00010000,  16, 0.00, 0.07, (0.00)
T 5: 00101000,  40, 0.53, 0.13, (0.00)
*********************************************

G: 1
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (0.00)
P 1: 01111100, 124, 0.80, 0.47, (0.00)
P 2: 01001110,  78, 0.93, 0.27, (0.00)
P 3: 11011000, 216, 0.53, 0.87, (0.00)
P 4: 00010000,  16, 0.00, 0.07, (0.00)
P 5: 00101000,  40, 0.53, 0.13, (0.00)
---------------------------------------------
T 0: 01111101, 125, 0.87, 0.47, (0.00)
T 1: 01111101, 125, 0.87, 0.47, (0.00)
T 2: 00000111,   7, 0.47, 0.00, (0.00)
T 3: 00000110,   6, 0.40, 0.00, (0.00)
T 4: 00000111,   7, 0.47, 0.00, (0.00)
T 5: 00000111,   7, 0.47, 0.00, (0.00)
*********************************************

G: 2
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 01111101, 125, 0.87, 0.47, (0.00)
P 1: 01111101, 125, 0.87, 0.47, (0.00)
P 2: 00000111,   7, 0.47, 0.00, (0.00)
P 3: 00000110,   6, 0.40, 0.00, (0.00)
P 4: 00000111,   7, 0.47, 0.00, (0.00)
P 5: 00000111,   7, 0.47, 0.00, (0.00)
---------------------------------------------
T 0: 01111101, 125, 0.87, 0.47, (0.00)
T 1: 01111101, 125, 0.87, 0.47, (0.00)
T 2: 01111101, 125, 0.87, 0.47, (0.00)
T 3: 01111101, 125, 0.87, 0.47, (0.00)
T 4: 01111001, 121, 0.60, 0.47, (0.00)
T 5: 01011101,  93, 0.87, 0.33, (0.00)
*********************************************

G: 3
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 01111101, 125, 0.87, 0.47, (0.00)
P 1: 01111101, 125, 0.87, 0.47, (0.00)
P 2: 01111101, 125, 0.87, 0.47, (0.00)
P 3: 01111101, 125, 0.87, 0.47, (0.00)
P 4: 01111001, 121, 0.60, 0.47, (0.00)
P 5: 01011101,  93, 0.87, 0.33, (0.00)
---------------------------------------------
T 0: 11111101, 253, 0.87, 1.00, (0.00)
T 1: 11111101, 253, 0.87, 1.00, (0.00)
T 2: 11111101, 253, 0.87, 1.00, (0.00)
T 3: 11011111, 223, 1.00, 0.87, (0.00)
T 4: 11111101, 253, 0.87, 1.00, (0.00)
T 5: 11111101, 253, 0.87, 1.00, (0.00)
*********************************************

G: 4
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 11111101, 253, 0.87, 1.00, (0.00)
P 1: 11111101, 253, 0.87, 1.00, (0.00)
P 2: 11111101, 253, 0.87, 1.00, (0.00)
P 3: 11011111, 223, 1.00, 0.87, (0.00)
P 4: 11111101, 253, 0.87, 1.00, (0.00)
P 5: 11111101, 253, 0.87, 1.00, (0.00)
---------------------------------------------
T 0: 11111001, 249, 0.60, 1.00, (0.00)
T 1: 11111101, 253, 0.87, 1.00, (0.00)
T 2: 11111011, 251, 0.73, 1.00, (0.00)
T 3: 11111101, 253, 0.87, 1.00, (0.00)
T 4: 11110101, 245, 0.33, 1.00, (0.00)
T 5: 11111101, 253, 0.87, 1.00, (0.00)
*********************************************

G: 5
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 11111001, 249, 0.60, 1.00, (0.00)
P 1: 11111101, 253, 0.87, 1.00, (0.00)
P 2: 11111011, 251, 0.73, 1.00, (0.00)
P 3: 11111101, 253, 0.87, 1.00, (0.00)
P 4: 11110101, 245, 0.33, 1.00, (0.00)
P 5: 11111101, 253, 0.87, 1.00, (0.00)
---------------------------------------------
T 0: 11111001, 249, 0.60, 1.00, (0.00)
T 1: 10111111, 191, 1.00, 0.73, (0.00)
T 2: 11110001, 241, 0.07, 1.00, (0.00)
T 3: 11111111, 255, 1.00, 1.00, (0.00)
T 4: 10101111, 175, 1.00, 0.67, (0.00)
T 5: 10111001, 185, 0.60, 0.73, (0.00)
*********************************************

G: 6
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 11111001, 249, 0.60, 1.00, (0.00)
P 1: 10111111, 191, 1.00, 0.73, (0.00)
P 2: 11110001, 241, 0.07, 1.00, (0.00)
P 3: 11111111, 255, 1.00, 1.00, (0.00)
P 4: 10101111, 175, 1.00, 0.67, (0.00)
P 5: 10111001, 185, 0.60, 0.73, (0.00)
---------------------------------------------
T 0: 10111000, 184, 0.53, 0.73, (0.00)
T 1: 10111111, 191, 1.00, 0.73, (0.00)
T 2: 10111000, 184, 0.53, 0.73, (0.00)
T 3: 10101000, 168, 0.53, 0.67, (0.00)
T 4: 10111100, 188, 0.80, 0.73, (0.00)
T 5: 10111010, 186, 0.67, 0.73, (0.00)
*********************************************

G: 7
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 10111000, 184, 0.53, 0.73, (0.00)
P 1: 10111111, 191, 1.00, 0.73, (0.00)
P 2: 10111000, 184, 0.53, 0.73, (0.00)
P 3: 10101000, 168, 0.53, 0.67, (0.00)
P 4: 10111100, 188, 0.80, 0.73, (0.00)
P 5: 10111010, 186, 0.67, 0.73, (0.00)
---------------------------------------------
T 0: 10111111, 191, 1.00, 0.73, (0.00)
T 1: 10111111, 191, 1.00, 0.73, (0.00)
T 2: 10111111, 191, 1.00, 0.73, (0.00)
T 3: 10111111, 191, 1.00, 0.73, (0.00)
T 4: 10111111, 191, 1.00, 0.73, (0.00)
T 5: 10111111, 191, 1.00, 0.73, (0.00)
*********************************************

G: 8
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 10111111, 191, 1.00, 0.73, (0.00)
P 1: 10111111, 191, 1.00, 0.73, (0.00)
P 2: 10111111, 191, 1.00, 0.73, (0.00)
P 3: 10111111, 191, 1.00, 0.73, (0.00)
P 4: 10111111, 191, 1.00, 0.73, (0.00)
P 5: 10111111, 191, 1.00, 0.73, (0.00)
---------------------------------------------
T 0: 10111111, 191, 1.00, 0.73, (0.00)
T 1: 00111111,  63, 1.00, 0.20, (0.00)
T 2: 10111111, 191, 1.00, 0.73, (0.00)
T 3: 10111111, 191, 1.00, 0.73, (0.00)
T 4: 10110101, 181, 0.33, 0.73, (0.00)
T 5: 10111111, 191, 1.00, 0.73, (0.00)
*********************************************

G: 9
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 10111111, 191, 1.00, 0.73, (0.00)
P 1: 00111111,  63, 1.00, 0.20, (0.00)
P 2: 10111111, 191, 1.00, 0.73, (0.00)
P 3: 10111111, 191, 1.00, 0.73, (0.00)
P 4: 10110101, 181, 0.33, 0.73, (0.00)
P 5: 10111111, 191, 1.00, 0.73, (0.00)
---------------------------------------------
T 0: 00110110,  54, 0.40, 0.20, (0.00)
T 1: 00110110,  54, 0.40, 0.20, (0.00)
T 2: 00110010,  50, 0.13, 0.20, (0.00)
T 3: 00110110,  54, 0.40, 0.20, (0.00)
T 4: 00110110,  54, 0.40, 0.20, (0.00)
T 5: 00110110,  54, 0.40, 0.20, (0.00)
*********************************************

G: 10
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00110110,  54, 0.40, 0.20, (0.00)
P 1: 00110110,  54, 0.40, 0.20, (0.00)
P 2: 00110010,  50, 0.13, 0.20, (0.00)
P 3: 00110110,  54, 0.40, 0.20, (0.00)
P 4: 00110110,  54, 0.40, 0.20, (0.00)
P 5: 00110110,  54, 0.40, 0.20, (0.00)
---------------------------------------------
T 0: 00111110,  62, 0.93, 0.20, (0.00)
T 1: 00101110,  46, 0.93, 0.13, (0.00)
T 2: 00111110,  62, 0.93, 0.20, (0.00)
T 3: 00111110,  62, 0.93, 0.20, (0.00)
T 4: 00101110,  46, 0.93, 0.13, (0.00)
T 5: 00111110,  62, 0.93, 0.20, (0.00)
*********************************************

G: 11
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00111110,  62, 0.93, 0.20, (0.00)
P 1: 00101110,  46, 0.93, 0.13, (0.00)
P 2: 00111110,  62, 0.93, 0.20, (0.00)
P 3: 00111110,  62, 0.93, 0.20, (0.00)
P 4: 00101110,  46, 0.93, 0.13, (0.00)
P 5: 00111110,  62, 0.93, 0.20, (0.00)
---------------------------------------------
T 0: 00111100,  60, 0.80, 0.20, (0.00)
T 1: 00101100,  44, 0.80, 0.13, (0.00)
T 2: 00101000,  40, 0.53, 0.13, (0.00)
T 3: 00111100,  60, 0.80, 0.20, (0.00)
T 4: 00111100,  60, 0.80, 0.20, (0.00)
T 5: 00101100,  44, 0.80, 0.13, (0.00)
*********************************************

G: 12
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00111100,  60, 0.80, 0.20, (0.00)
P 1: 00101100,  44, 0.80, 0.13, (0.00)
P 2: 00101000,  40, 0.53, 0.13, (0.00)
P 3: 00111100,  60, 0.80, 0.20, (0.00)
P 4: 00111100,  60, 0.80, 0.20, (0.00)
P 5: 00101100,  44, 0.80, 0.13, (0.00)
---------------------------------------------
T 0: 00101100,  44, 0.80, 0.13, (0.00)
T 1: 00101100,  44, 0.80, 0.13, (0.00)
T 2: 00101000,  40, 0.53, 0.13, (0.00)
T 3: 00101100,  44, 0.80, 0.13, (0.00)
T 4: 00100100,  36, 0.27, 0.13, (0.00)
T 5: 00101100,  44, 0.80, 0.13, (0.00)
*********************************************

G: 13
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00101100,  44, 0.80, 0.13, (0.00)
P 1: 00101100,  44, 0.80, 0.13, (0.00)
P 2: 00101000,  40, 0.53, 0.13, (0.00)
P 3: 00101100,  44, 0.80, 0.13, (0.00)
P 4: 00100100,  36, 0.27, 0.13, (0.00)
P 5: 00101100,  44, 0.80, 0.13, (0.00)
---------------------------------------------
T 0: 00101100,  44, 0.80, 0.13, (0.00)
T 1: 00100100,  36, 0.27, 0.13, (0.00)
T 2: 01101100, 108, 0.80, 0.40, (0.00)
T 3: 00101100,  44, 0.80, 0.13, (0.00)
T 4: 00101100,  44, 0.80, 0.13, (0.00)
T 5: 00110100,  52, 0.27, 0.20, (0.00)
*********************************************

G: 14
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00101100,  44, 0.80, 0.13, (0.00)
P 1: 00100100,  36, 0.27, 0.13, (0.00)
P 2: 01101100, 108, 0.80, 0.40, (0.00)
P 3: 00101100,  44, 0.80, 0.13, (0.00)
P 4: 00101100,  44, 0.80, 0.13, (0.00)
P 5: 00110100,  52, 0.27, 0.20, (0.00)
---------------------------------------------
T 0: 00100100,  36, 0.27, 0.13, (0.00)
T 1: 00100100,  36, 0.27, 0.13, (0.00)
T 2: 00100100,  36, 0.27, 0.13, (0.00)
T 3: 00100100,  36, 0.27, 0.13, (0.00)
T 4: 00101100,  44, 0.80, 0.13, (0.00)
T 5: 00100100,  36, 0.27, 0.13, (0.00)
*********************************************

G: 15
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00100100,  36, 0.27, 0.13, (0.00)
P 1: 00100100,  36, 0.27, 0.13, (0.00)
P 2: 00100100,  36, 0.27, 0.13, (0.00)
P 3: 00100100,  36, 0.27, 0.13, (0.00)
P 4: 00101100,  44, 0.80, 0.13, (0.00)
P 5: 00100100,  36, 0.27, 0.13, (0.00)
---------------------------------------------
T 0: 00100100,  36, 0.27, 0.13, (0.00)
T 1: 00110100,  52, 0.27, 0.20, (0.00)
T 2: 00110100,  52, 0.27, 0.20, (0.00)
T 3: 00110100,  52, 0.27, 0.20, (0.00)
T 4: 00110100,  52, 0.27, 0.20, (0.00)
T 5: 00110100,  52, 0.27, 0.20, (0.00)
*********************************************

G: 16
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00100100,  36, 0.27, 0.13, (0.00)
P 1: 00110100,  52, 0.27, 0.20, (0.00)
P 2: 00110100,  52, 0.27, 0.20, (0.00)
P 3: 00110100,  52, 0.27, 0.20, (0.00)
P 4: 00110100,  52, 0.27, 0.20, (0.00)
P 5: 00110100,  52, 0.27, 0.20, (0.00)
---------------------------------------------
T 0: 00110100,  52, 0.27, 0.20, (0.00)
T 1: 00110100,  52, 0.27, 0.20, (0.00)
T 2: 00111100,  60, 0.80, 0.20, (0.00)
T 3: 01110100, 116, 0.27, 0.47, (0.00)
T 4: 00110100,  52, 0.27, 0.20, (0.00)
T 5: 00110100,  52, 0.27, 0.20, (0.00)
*********************************************

G: 17
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00110100,  52, 0.27, 0.20, (0.00)
P 1: 00110100,  52, 0.27, 0.20, (0.00)
P 2: 00111100,  60, 0.80, 0.20, (0.00)
P 3: 01110100, 116, 0.27, 0.47, (0.00)
P 4: 00110100,  52, 0.27, 0.20, (0.00)
P 5: 00110100,  52, 0.27, 0.20, (0.00)
---------------------------------------------
T 0: 00110100,  52, 0.27, 0.20, (0.00)
T 1: 01110000, 112, 0.00, 0.47, (0.00)
T 2: 01110000, 112, 0.00, 0.47, (0.00)
T 3: 01110100, 116, 0.27, 0.47, (0.00)
T 4: 00111100,  60, 0.80, 0.20, (0.00)
T 5: 01110000, 112, 0.00, 0.47, (0.00)
*********************************************

G: 18
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00110100,  52, 0.27, 0.20, (0.00)
P 1: 01110000, 112, 0.00, 0.47, (0.00)
P 2: 01110000, 112, 0.00, 0.47, (0.00)
P 3: 01110100, 116, 0.27, 0.47, (0.00)
P 4: 00111100,  60, 0.80, 0.20, (0.00)
P 5: 01110000, 112, 0.00, 0.47, (0.00)
---------------------------------------------
T 0: 00111000,  56, 0.53, 0.20, (0.00)
T 1: 01111001, 121, 0.60, 0.47, (0.00)
T 2: 00100001,  33, 0.07, 0.13, (0.00)
T 3: 01111001, 121, 0.60, 0.47, (0.00)
T 4: 00111000,  56, 0.53, 0.20, (0.00)
T 5: 11111101, 253, 0.87, 1.00, (0.00)
*********************************************

G: 19
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00111000,  56, 0.53, 0.20, (0.00)
P 1: 01111001, 121, 0.60, 0.47, (0.00)
P 2: 00100001,  33, 0.07, 0.13, (0.00)
P 3: 01111001, 121, 0.60, 0.47, (0.00)
P 4: 00111000,  56, 0.53, 0.20, (0.00)
P 5: 11111101, 253, 0.87, 1.00, (0.00)
---------------------------------------------
T 0: 00101000,  40, 0.53, 0.13, (0.00)
T 1: 01111000, 120, 0.53, 0.47, (0.00)
T 2: 00001001,   9, 0.60, 0.00, (0.00)
T 3: 00101000,  40, 0.53, 0.13, (0.00)
T 4: 00101010,  42, 0.67, 0.13, (0.00)
T 5: 01111000, 120, 0.53, 0.47, (0.00)
*********************************************

G: 20
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00101000,  40, 0.53, 0.13, (0.00)
P 1: 01111000, 120, 0.53, 0.47, (0.00)
P 2: 00001001,   9, 0.60, 0.00, (0.00)
P 3: 00101000,  40, 0.53, 0.13, (0.00)
P 4: 00101010,  42, 0.67, 0.13, (0.00)
P 5: 01111000, 120, 0.53, 0.47, (0.00)
---------------------------------------------
T 0: 00101000,  40, 0.53, 0.13, (0.00)
T 1: 00001000,   8, 0.53, 0.00, (0.00)
T 2: 00100001,  33, 0.07, 0.13, (0.00)
T 3: 00001100,  12, 0.80, 0.00, (0.00)
T 4: 00100001,  33, 0.07, 0.13, (0.00)
T 5: 00101000,  40, 0.53, 0.13, (0.00)
*********************************************

G: 21
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00101000,  40, 0.53, 0.13, (0.00)
P 1: 00001000,   8, 0.53, 0.00, (0.00)
P 2: 00100001,  33, 0.07, 0.13, (0.00)
P 3: 00001100,  12, 0.80, 0.00, (0.00)
P 4: 00100001,  33, 0.07, 0.13, (0.00)
P 5: 00101000,  40, 0.53, 0.13, (0.00)
---------------------------------------------
T 0: 00101000,  40, 0.53, 0.13, (0.00)
T 1: 00101000,  40, 0.53, 0.13, (0.00)
T 2: 00101000,  40, 0.53, 0.13, (0.00)
T 3: 00101000,  40, 0.53, 0.13, (0.00)
T 4: 00101000,  40, 0.53, 0.13, (0.00)
T 5: 00101000,  40, 0.53, 0.13, (0.00)
*********************************************

G: 22
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00101000,  40, 0.53, 0.13, (0.00)
P 1: 00101000,  40, 0.53, 0.13, (0.00)
P 2: 00101000,  40, 0.53, 0.13, (0.00)
P 3: 00101000,  40, 0.53, 0.13, (0.00)
P 4: 00101000,  40, 0.53, 0.13, (0.00)
P 5: 00101000,  40, 0.53, 0.13, (0.00)
---------------------------------------------
T 0: 00101000,  40, 0.53, 0.13, (0.00)
T 1: 00101001,  41, 0.60, 0.13, (0.00)
T 2: 00111100,  60, 0.80, 0.20, (0.00)
T 3: 00101000,  40, 0.53, 0.13, (0.00)
T 4: 00111011,  59, 0.73, 0.20, (0.00)
T 5: 00101001,  41, 0.60, 0.13, (0.00)
*********************************************

G: 23
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00101000,  40, 0.53, 0.13, (0.00)
P 1: 00101001,  41, 0.60, 0.13, (0.00)
P 2: 00111100,  60, 0.80, 0.20, (0.00)
P 3: 00101000,  40, 0.53, 0.13, (0.00)
P 4: 00111011,  59, 0.73, 0.20, (0.00)
P 5: 00101001,  41, 0.60, 0.13, (0.00)
---------------------------------------------
T 0: 00110100,  52, 0.27, 0.20, (0.00)
T 1: 00101001,  41, 0.60, 0.13, (0.00)
T 2: 00101001,  41, 0.60, 0.13, (0.00)
T 3: 00110001,  49, 0.07, 0.20, (0.00)
T 4: 00110100,  52, 0.27, 0.20, (0.00)
T 5: 00011000,  24, 0.53, 0.07, (0.00)
*********************************************

G: 24
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00110100,  52, 0.27, 0.20, (0.00)
P 1: 00101001,  41, 0.60, 0.13, (0.00)
P 2: 00101001,  41, 0.60, 0.13, (0.00)
P 3: 00110001,  49, 0.07, 0.20, (0.00)
P 4: 00110100,  52, 0.27, 0.20, (0.00)
P 5: 00011000,  24, 0.53, 0.07, (0.00)
---------------------------------------------
T 0: 00101001,  41, 0.60, 0.13, (0.00)
T 1: 00101001,  41, 0.60, 0.13, (0.00)
T 2: 00101001,  41, 0.60, 0.13, (0.00)
T 3: 00101001,  41, 0.60, 0.13, (0.00)
T 4: 00101101,  45, 0.87, 0.13, (0.00)
T 5: 00101001,  41, 0.60, 0.13, (0.00)
*********************************************

G: 25
BEST TRANS-GENERATION
00000111,   7, 0.47, 0.00 (0.00)
*********************************************
P 0: 00101001,  41, 0.60, 0.13, (0.00)
P 1: 00101001,  41, 0.60, 0.13, (0.00)
P 2: 00101001,  41, 0.60, 0.13, (0.00)
P 3: 00101001,  41, 0.60, 0.13, (0.00)
P 4: 00101101,  45, 0.87, 0.13, (0.00)
P 5: 00101001,  41, 0.60, 0.13, (0.00)
---------------------------------------------
T 0: 00100001,  33, 0.07, 0.13, 
nsh> [K(0.00)
T 1: 00001001,   9, 0.60, 0.00, 
nsh> [K
nsh> [Kfl(0.00)
T 2: 00100001,  33, 0.07, 0.13, apping stop
nsh> flapping: exiting.
[K
nsh> [K
nsh> [K
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 01001101,  77, 0.87, 0.27, (-100000.0000000)
P 1: 00011100,  28, 0.80, 0.07, (-100000.0000000)
P 2: 11010101, 213, 0.33, 0.87, (-100000.0000000)
P 3: 01100000,  96, 0.00, 0.40, (-100000.0000000)
P 4: 01110000, 112, 0.00, 0.47, (-100000.0000000)
P 5: 01000110,  70, 0.40, 0.27, (-100000.0000000)
---------------------------------------------
nsh> [K(0.53)
T 1: 00011100,  28, 0.80, 0.07, (0.30)
T 2: 11010101, 213, 0.33, 0.87, (0.30)
T 3: 01100000,  96, 0.00, 0.40, (-0.63)
T 4: 01110000, 112, 0.00, 0.47, (-0.38)
T 5: 01000110,  70, 0.40, 0.27, (0.29)
*********************************************

G: 1
BEST TRANS-GENERATION
01001101,  77, 0.87, 0.27 (0.53)
*********************************************
P 0: 01001101,  77, 0.87, 0.27, (0.53)
P 1: 00011100,  28, 0.80, 0.07, (0.30)
P 2: 11010101, 213, 0.33, 0.87, (0.30)
P 3: 01000110,  70, 0.40, 0.27, (0.29)
P 4: 01110000, 112, 0.00, 0.47, (-0.38)
P 5: 01100000,  96, 0.00, 0.40, (-0.63)
---------------------------------------------
T 0: 01001101,  77, 0.87, 0.27, 
nsh> [Kflapping stop
nsh> [Kflapping: exiting.

nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 11101001, 233, 0.60, 0.93, (-100000.0000000)
P 1: 10110110, 182, 0.40, 0.73, (-100000.0000000)
P 2: 10001011, 139, 0.73, 0.53, (-100000.0000000)
P 3: 00010110,  22, 0.40, 0.07, (-100000.0000000)
P 4: 00001010,  10, 0.67, 0.00, (-100000.0000000)
P 5: 11000111, 199, 0.47, 0.80, (-100000.0000000)
---------------------------------------------
nsh> [K(0.04)
T 1: 10110110, 182, 0.40, 0.73, (0.04)
T 2: 10001011, 139, 0.73, 0.53, (0.25)
T 3: 00010110,  22, 0.40, 0.07, (0.48)
T 4: 00001010,  10, 0.67, 0.00, (0.47)
T 5: 11000111, 199, 0.47, 0.80, (0.07)
*********************************************

G: 1
BEST TRANS-GENERATION
00010110,  22, 0.40, 0.07 (0.48)
*********************************************
P 0: 00010110,  22, 0.40, 0.07, (0.48)
P 1: 00001010,  10, 0.67, 0.00, (0.47)
P 2: 10001011, 139, 0.73, 0.53, (0.25)
P 3: 11000111, 199, 0.47, 0.80, (0.07)
P 4: 10110110, 182, 0.40, 0.73, (0.04)
P 5: 11101001, 233, 0.60, 0.93, (0.04)
---------------------------------------------
T 0: 00010110,  22, 0.40, 0.07, (0.48)
T 1: 00010110,  22, 0.40, 0.07, (0.49)
T 2: 00011010,  26, 0.67, 0.07, (0.51)
T 3: 00001010,  10, 0.67, 0.00, (0.46)
T 4: 00001010,  10, 0.67, 0.00, (0.47)
T 5: 00001010,  10, 0.67, 0.00, (0.47)
*********************************************

G: 2
BEST TRANS-GENERATION
00011010,  26, 0.67, 0.07 (0.51)
*********************************************
P 0: 00011010,  26, 0.67, 0.07, (0.51)
P 1: 00010110,  22, 0.40, 0.07, (0.49)
P 2: 00010110,  22, 0.40, 0.07, (0.48)
P 3: 00001010,  10, 0.67, 0.00, (0.47)
P 4: 00001010,  10, 0.67, 0.00, (0.47)
P 5: 00001010,  10, 0.67, 0.00, (0.46)
---------------------------------------------
T 0: 00010010,  18, 0.13, 0.07, (0.02)
T 1: 00011110,  30, 0.93, 0.07, (0.01)
T 2: 00010110,  22, 0.40, 0.07, (0.49)
T 3: 00010010,  18, 0.13, 0.07, (0.03)
T 4: 00000010,   2, 0.13, 0.00, (0.06)
T 5: 00011110,  30, 0.93, 0.07, (0.01)
*********************************************

G: 3
BEST TRANS-GENERATION
00011010,  26, 0.67, 0.07 (0.51)
*********************************************
P 0: 00010110,  22, 0.40, 0.07, (0.49)
P 1: 00000010,   2, 0.13, 0.00, (0.06)
P 2: 00010010,  18, 0.13, 0.07, (0.03)
P 3: 00010010,  18, 0.13, 0.07, (0.02)
P 4: 00011110,  30, 0.93, 0.07, (0.01)
P 5: 00011110,  30, 0.93, 0.07, (0.01)
---------------------------------------------
T 0: 00000110,   6, 0.40, 0.00, (0.51)
T 1: 00000010,   2, 0.13, 0.00, (0.07)
T 2: 00000010,   2, 0.13, 0.00, (0.06)
T 3: 00000010,   2, 0.13, 0.00, (0.06)
T 4: 00000110,   6, 0.40, 0.00, (0.51)
T 5: 00001010,  10, 0.67, 0.00, (0.47)
*********************************************

G: 4
BEST TRANS-GENERATION
00011010,  26, 0.67, 0.07 (0.51)
*********************************************
P 0: 00000110,   6, 0.40, 0.00, (0.51)
P 1: 00000110,   6, 0.40, 0.00, (0.51)
P 2: 00001010,  10, 0.67, 0.00, (0.47)
P 3: 00000010,   2, 0.13, 0.00, (0.07)
P 4: 00000010,   2, 0.13, 0.00, (0.06)
P 5: 00000010,   2, 0.13, 0.00, (0.06)
---------------------------------------------
T 0: 01000110,  70, 0.40, 0.27, (0.38)
T 1: 00000110,   6, 0.40, 0.00, (0.53)
T 2: 00000110,   6, 0.40, 0.00, (0.51)
T 3: 00000110,   6, 0.40, 0.00, (0.51)
T 4: 01000010,  66, 0.13, 0.27, (0.02)
T 5: 00000110,   6, 0.40, 0.00, (0.52)
*********************************************

G: 5
BEST TRANS-GENERATION
00000110,   6, 0.40, 0.00 (0.53)
*********************************************
P 0: 00000110,   6, 0.40, 0.00, (0.53)
P 1: 00000110,   6, 0.40, 0.00, (0.52)
P 2: 00000110,   6, 0.40, 0.00, (0.51)
P 3: 00000110,   6, 0.40, 0.00, (0.51)
P 4: 01000110,  70, 0.40, 0.27, (0.38)
P 5: 01000010,  66, 0.13, 0.27, (0.02)
---------------------------------------------
T 0: 00000110,   6, 0.40, 0.00, (0.51)
T 1: 00001110,  14, 0.93, 0.00, (0.07)
T 2: 00000110,   6, 0.40, 0.00, (0.50)
T 3: 00001010,  10, 0.67, 0.00, (0.46)
T 4: 00000111,   7, 0.47, 0.00, (0.52)
T 5: 00011110,  30, 0.93, 0.07, (-0.01)
*********************************************

G: 6
BEST TRANS-GENERATION
00000110,   6, 0.40, 0.00 (0.53)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (0.52)
P 1: 00000110,   6, 0.40, 0.00, (0.51)
P 2: 00000110,   6, 0.40, 0.00, (0.50)
P 3: 00001010,  10, 0.67, 0.00, (0.46)
P 4: 00001110,  14, 0.93, 0.00, (0.07)
P 5: 00011110,  30, 0.93, 0.07, (-0.01)
---------------------------------------------
T 0: 00000110,   6, 0.40, 0.00, (0.51)
T 1: 00000110,   6, 0.40, 0.00, (0.52)
T 2: 10000010, 130, 0.13, 0.53, (-0.30)
T 3: 00010110,  22, 0.40, 0.07, (0.47)
T 4: 00000110,   6, 0.40, 0.00, (0.51)
T 5: 00100111,  39, 0.47, 0.13, (0.47)
*********************************************

G: 7
BEST TRANS-GENERATION
00000110,   6, 0.40, 0.00 (0.53)
*********************************************
P 0: 00000110,   6, 0.40, 0.00, (0.52)
P 1: 00000110,   6, 0.40, 0.00, (0.51)
P 2: 00000110,   6, 0.40, 0.00, (0.51)
P 3: 00010110,  22, 0.40, 0.07, (0.47)
P 4: 00100111,  39, 0.47, 0.13, (0.47)
P 5: 10000010, 130, 0.13, 0.53, (-0.30)
---------------------------------------------
T 0: 00000110,   6, 0.40, 0.00, (0.51)
T 1: 00000100,   4, 0.27, 0.00, (0.25)
T 2: 00000100,   4, 0.27, 0.00, (0.25)
T 3: 00000110,   6, 0.40, 0.00, (0.50)
T 4: 00100110,  38, 0.40, 0.13, (0.43)
T 5: 00001100,  12, 0.80, 0.00, (0.21)
*********************************************

G: 8
BEST TRANS-GENERATION
00000110,   6, 0.40, 0.00 (0.53)
*********************************************
P 0: 00000110,   6, 0.40, 0.00, (0.51)
P 1: 00000110,   6, 0.40, 0.00, (0.50)
P 2: 00100110,  38, 0.40, 0.13, (0.43)
P 3: 00000100,   4, 0.27, 0.00, (0.25)
P 4: 00000100,   4, 0.27, 0.00, (0.25)
P 5: 00001100,  12, 0.80, 0.00, (0.21)
---------------------------------------------
T 0: 00000010,   2, 0.13, 0.00, (0.07)
T 1: 00100110,  38, 0.40, 0.13, (0.44)
T 2: 00000010,   2, 0.13, 0.00, (0.06)
T 3: 00000010,   2, 0.13, 0.00, (0.06)
T 4: 00000010,   2, 0.13, 0.00, (0.06)
T 5: 00100010,  34, 0.13, 0.13, (0.11)
*********************************************

G: 9
BEST TRANS-GENERATION
00000110,   6, 0.40, 0.00 (0.53)
*********************************************
P 0: 00100110,  38, 0.40, 0.13, (0.44)
P 1: 00100010,  34, 0.13, 0.13, (0.11)
P 2: 00000010,   2, 0.13, 0.00, (0.07)
P 3: 00000010,   2, 0.13, 0.00, (0.06)
P 4: 00000010,   2, 0.13, 0.00, (0.06)
P 5: 00000010,   2, 0.13, 0.00, (0.06)
---------------------------------------------
T 0: 00100110,  38, 0.40, 0.13, (0.45)
T 1: 00100110,  38, 0.40, 0.13, (0.44)
T 2: 00100110,  38, 0.40, 0.13, (0.44)
T 3: 00100110,  38, 0.40, 0.13, (0.43)
T 4: 00100111,  39, 0.47, 0.13, (0.47)
T 5: 00110010,  50, 0.13, 0.20, (0.10)
*********************************************

G: 10
BEST TRANS-GENERATION
00000110,   6, 0.40, 0.00 (0.53)
*********************************************
P 0: 00100111,  39, 0.47, 0.13, (0.47)
P 1: 00100110,  38, 0.40, 0.13, (0.45)
P 2: 00100110,  38, 0.40, 0.13, (0.44)
P 3: 00100110,  38, 0.40, 0.13, (0.44)
P 4: 00100110,  38, 0.40, 0.13, (0.43)
P 5: 00110010,  50, 0.13, 0.20, (0.10)
---------------------------------------------
T 0: 00100111,  39, 0.47, 0.13, (0.47)
T 1: 00110100,  52, 0.27, 0.20, (0.24)
T 2: 00110100,  52, 0.27, 0.20, (0.24)
T 3: 00111100,  60, 0.80, 0.20, (0.29)
T 4: 00110100,  52, 0.27, 0.20, (0.25)
T 5: 00110100,  52, 0.27, 0.20, (0.25)
*********************************************

G: 11
BEST TRANS-GENERATION
00000110,   6, 0.40, 0.00 (0.53)
*********************************************
P 0: 00100111,  39, 0.47, 0.13, (0.47)
P 1: 00111100,  60, 0.80, 0.20, (0.29)
P 2: 00110100,  52, 0.27, 0.20, (0.25)
P 3: 00110100,  52, 0.27, 0.20, (0.25)
P 4: 00110100,  52, 0.27, 0.20, (0.24)
P 5: 00110100,  52, 0.27, 0.20, (0.24)
---------------------------------------------
T 0: 00100100,  36, 0.27, 0.13, 
nsh> [Kflapping stop
flapping: exiting.
nsh> [K! 
nsh: !: command not found
nsh> [K
nsh> [K
nsh> [Kreboot -b

nsh> [K
nsh> [Kflapping stop
nsh> [K
nsh> [Kflappint start
nsh: flappint: command not found
nsh> [Kfp[Klapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 10010011, 147, 0.20, 0.60, (-100000.0000000)
P 1: 10011100, 156, 0.80, 0.60, (-100000.0000000)
P 2: 11111000, 248, 0.53, 1.00, (-100000.0000000)
P 3: 01110111, 119, 0.47, 0.47, (-100000.0000000)
P 4: 00101101,  45, 0.87, 0.13, (-100000.0000000)
P 5: 01110100, 116, 0.27, 0.47, (-100000.0000000)
---------------------------------------------
nsh> [K
nsh> [K
nsh> [K(-0.40)
T 1: 10011100, 156, 0.80, 0.60, (-0.22)
T 2: 11111000, 248, 0.53, 1.00, (-0.36)
T 3: 01110111, 119, 0.47, 0.47, (0.03)
T 4: 00101101,  45, 0.87, 0.13, (-0.39)
T 5: 01110100, 116, 0.27, 0.47, (-0.17)
*********************************************

G: 1
BEST TRANS-GENERATION
01110111, 119, 0.47, 0.47 (0.03)
*********************************************
P 0: 01110111, 119, 0.47, 0.47, (0.03)
P 1: 01110100, 116, 0.27, 0.47, (-0.17)
P 2: 10011100, 156, 0.80, 0.60, (-0.22)
P 3: 11111000, 248, 0.53, 1.00, (-0.36)
P 4: 00101101,  45, 0.87, 0.13, (-0.39)
P 5: 10010011, 147, 0.20, 0.60, (-0.40)
---------------------------------------------
T 0: 01110100, 116, 0.27, 0.47, (-0.16)
T 1: 01110111, 119, 0.47, 0.47, (0.02)
T 2: 01110111, 119, 0.47, 0.47, (0.01)
T 3: 01110111, 119, 0.47, 0.47, (0.02)
T 4: 01110000, 112, 0.00, 0.47, (-0.48)
T 5: 01010100,  84, 0.27, 0.33, ! 
nsh: !: command not found
nsh> [K
nsh> [K
nsh> [Kreboot -b

nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [Kfl[K[Kflapping stop
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (-100000.0000000)
P 1: 01111100, 124, 0.80, 0.47, (-100000.0000000)
P 2: 01001110,  78, 0.93, 0.27, (-100000.0000000)
P 3: 11011000, 216, 0.53, 0.87, (-100000.0000000)
P 4: 00010000,  16, 0.00, 0.07, (-100000.0000000)
P 5: 00101000,  40, 0.53, 0.13, (-100000.0000000)
---------------------------------------------
nsh> [K(0.42)
T 1: 01111100, 124, 0.80, 0.47, (0.02)
T 2: 01001110,  78, 0.93, 0.27, (-0.26)
T 3: 11011000, 216, 0.53, 0.87, (-0.06)
T 4: 00010000,  16, 0.00, 0.07, (-0.02)
T 5: 00101000,  40, 0.53, 0.13, (0.42)
*********************************************

G: 1
BEST TRANS-GENERATION
00101000,  40, 0.53, 0.13 (0.42)
*********************************************
P 0: 00101000,  40, 0.53, 0.13, (0.42)
P 1: 00000111,   7, 0.47, 0.00, (0.42)
P 2: 01111100, 124, 0.80, 0.47, (0.02)
P 3: 00010000,  16, 0.00, 0.07, (-0.02)
P 4: 11011000, 216, 0.53, 0.87, (-0.06)
P 5: 01001110,  78, 0.93, 0.27, (-0.26)
---------------------------------------------
T 0: 00000110,   6, 0.40, 0.00, (0.44)
T 1: 00000110,   6, 0.40, 0.00, (0.43)
T 2: 00101000,  40, 0.53, 0.13, (0.42)
T 3: 00101001,  41, 0.60, 0.13, (0.47)
T 4: 00101000,  40, 0.53, 0.13, (0.43)
T 5: 00101000,  40, 0.53, 0.13, (0.43)
*********************************************

G: 2
BEST TRANS-GENERATION
00101001,  41, 0.60, 0.13 (0.47)
*********************************************
P 0: 00101001,  41, 0.60, 0.13, (0.47)
P 1: 00000110,   6, 0.40, 0.00, (0.44)
P 2: 00000110,   6, 0.40, 0.00, (0.43)
P 3: 00101000,  40, 0.53, 0.13, (0.43)
P 4: 00101000,  40, 0.53, 0.13, (0.43)
P 5: 00101000,  40, 0.53, 0.13, (0.42)
---------------------------------------------
T 0: 00100110,  38, 0.40, 0.13, (0.37)
T 1: 00000110,   6, 0.40, 0.00, (0.45)
T 2: 00100110,  38, 0.40, 0.13, (0.35)
T 3: 00000110,   6, 0.40, 0.00, (0.43)
T 4: 00000010,   2, 0.13, 0.00, (0.05)
T 5: 00100110,  38, 0.40, 0.13, (0.35)
*********************************************

G: 3
BEST TRANS-GENERATION
00101001,  41, 0.60, 0.13 (0.47)
*********************************************
P 0: 00000110,   6, 0.40, 0.00, (0.45)
P 1: 00000110,   6, 0.40, 0.00, (0.43)
P 2: 00100110,  38, 0.40, 0.13, (0.37)
P 3: 00100110,  38, 0.40, 0.13, (0.35)
P 4: 00100110,  38, 0.40, 0.13, (0.35)
P 5: 00000010,   2, 0.13, 0.00, (0.05)
---------------------------------------------
T 0: 10000110, 134, 0.40, 0.53, (0.07)
T 1: 10000110, 134, 0.40, 0.53, (0.27)
T 2: 10000110, 134, 0.40, 0.53, (0.08)
T 3: 10100100, 164, 0.27, 0.67, (-0.18)
T 4: 10000110, 134, 0.40, 0.53, (0.08)
T 5: 10000110, 134, 0.40, 0.53, (0.08)
*********************************************

G: 4
BEST TRANS-GENERATION
00101001,  41, 0.60, 0.13 (0.47)
*********************************************
P 0: 10000110, 134, 0.40, 0.53, (0.27)
P 1: 10000110, 134, 0.40, 0.53, (0.08)
P 2: 10000110, 134, 0.40, 0.53, (0.08)
P 3: 10000110, 134, 0.40, 0.53, (0.08)
P 4: 10000110, 134, 0.40, 0.53, (0.07)
P 5: 10100100, 164, 0.27, 0.67, (-0.18)
---------------------------------------------
T 0: 10000010, 130, 0.13, 0.53, (-0.31)
T 1: 10000110, 134, 0.40, 0.53, (0.08)
T 2: 10000000, 128, 0.00, 0.53, (-0.50)
T 3: 10000110, 134, 0.40, 0.53, (0.07)
T 4: 10001110, 142, 0.93, 0.53, (-0.13)
T 5: 10000110, 134, 0.40, 0.53, (0.09)
*********************************************

G: 5
BEST TRANS-GENERATION
00101001,  41, 0.60, 0.13 (0.47)
*********************************************
P 0: 10000110, 134, 0.40, 0.53, (0.09)
P 1: 10000110, 134, 0.40, 0.53, (0.08)
P 2: 10000110, 134, 0.40, 0.53, (0.07)
P 3: 10001110, 142, 0.93, 0.53, (-0.13)
P 4: 10000010, 130, 0.13, 0.53, (-0.31)
P 5: 10000000, 128, 0.00, 0.53, (-0.50)
---------------------------------------------
T 0: 10000110, 134, 0.40, 0.53, (0.09)
T 1: 11000100, 196, 0.27, 0.80, (-0.30)
T 2: 10001110, 142, 0.93, 0.53, (-0.11)
T 3: 10000100, 132, 0.27, 0.53, (-0.06)
T 4: 11010100, 212, 0.27, 0.87, (-0.36)
T 5: 11000110, 198, 0.40, 0.80, (-0.12)
*********************************************

G: 6
BEST TRANS-GENERATION
00101001,  41, 0.60, 0.13 (0.47)
*********************************************
P 0: 10000110, 134, 0.40, 0.53, (0.09)
P 1: 10000100, 132, 0.27, 0.53, (-0.06)
P 2: 10001110, 142, 0.93, 0.53, (-0.11)
P 3: 11000110, 198, 0.40, 0.80, (-0.12)
P 4: 11000100, 196, 0.27, 0.80, (-0.30)
P 5: 11010100, 212, 0.27, 0.87, (-0.36)
---------------------------------------------
T 0: 10000111, 135, 0.47, 0.53, (0.18)
T 1: 10000100, 132, 0.27, 0.53, (-0.06)
T 2: 10000111, 135, 0.47, 0.53, (0.17)
T 3: 10010111, 151, 0.47, 0.60, (0.11)
T 4: 10000011, 131, 0.20, 0.53, (-0.18)
T 5: 10000101, 133, 0.33, 0.53, (0.01)
*********************************************

G: 7
BEST TRANS-GENERATION
00101001,  41, 0.60, 0.13 (0.47)
*********************************************
P 0: 10000111, 135, 0.47, 0.53, (0.18)
P 1: 10000111, 135, 0.47, 0.53, (0.17)
P 2: 10010111, 151, 0.47, 0.60, (0.11)
P 3: 10000101, 133, 0.33, 0.53, (0.01)
P 4: 10000100, 132, 0.27, 0.53, (-0.06)
P 5: 10000011, 131, 0.20, 0.53, (-0.18)
---------------------------------------------
T 0: 10000111, 135, 0.47, 0.53, (0.18)
T 1: 10000111, 135, 0.47, 0.53, (0.16)
T 2: 10000111, 135, 0.47, 0.53, (0.16)
T 3: 10000111, 135, 0.47, 0.53, 
nsh> [Kflapping stop
flapping: exiting.
nsh> [Kflapping stop[K[K[K[K[K[K[K[K[K[K[K[K[K
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00101111,  47, 1.00, 0.13, (-100000.0000000)
P 1: 10001011, 139, 0.73, 0.53, (-100000.0000000)
P 2: 01010110,  86, 0.40, 0.33, (-100000.0000000)
P 3: 11001110, 206, 0.93, 0.80, (-100000.0000000)
P 4: 10010011, 147, 0.20, 0.60, (-100000.0000000)
P 5: 00010101,  21, 0.33, 0.07, (-100000.0000000)
---------------------------------------------
nsh> [K(-0.39)
T 1: 10001011, 139, 0.73, 0.53, (0.09)
T 2: 01010110,  86, 0.40, 0.33, (0.29)
T 3: 11001110, 206, 0.93, 0.80, (0.03)
T 4: 10010011, 147, 0.20, 0.60, (-0.23)
T 5: 00010101,  21, 0.33, 0.07, (0.38)
*********************************************

G: 1
BEST TRANS-GENERATION
00010101,  21, 0.33, 0.07 (0.38)
*********************************************
P 0: 00010101,  21, 0.33, 0.07, (0.38)
P 1: 01010110,  86, 0.40, 0.33, (0.29)
P 2: 10001011, 139, 0.73, 0.53, (0.09)
P 3: 11001110, 206, 0.93, 0.80, (0.03)
P 4: 10010011, 147, 0.20, 0.60, (-0.23)
P 5: 00101111,  47, 1.00, 0.13, (-0.39)
---------------------------------------------
T 0: 01010110,  86, 0.40, 0.33, (0.26)
T 1: 01011001,  89, 0.60, 0.33, (0.42)
T 2: 01010110,  86, 0.40, 0.33, (0.26)
T 3: 01001011,  75, 0.73, 0.27, (0.21)
T 4: 10010101, 149, 0.33, 0.60, (-0.03)
T 5: 00010110,  22, 0.40, 0.07, (0.41)
*********************************************

G: 2
BEST TRANS-GENERATION
01011001,  89, 0.60, 0.33 (0.42)
*********************************************
P 0: 01011001,  89, 0.60, 0.33, (0.42)
P 1: 00010110,  22, 0.40, 0.07, (0.41)
P 2: 01010110,  86, 0.40, 0.33, (0.26)
P 3: 01010110,  86, 0.40, 0.33, (0.26)
P 4: 01001011,  75, 0.73, 0.27, (0.21)
P 5: 10010101, 149, 0.33, 0.60, (-0.03)
---------------------------------------------
T 0: 01011001,  89, 0.60, 0.33, (0.43)
T 1: 11010110, 214, 0.40, 0.87, (-0.15)
T 2: 01011010,  90, 0.67, 0.33, (0.32)
T 3: 01011010,  90, 0.67, 0.33, (0.32)
T 4: 01011010,  90, 0.67, 0.33, (0.30)
T 5: 01010110,  86, 0.40, 0.33, (0.24)
*********************************************

G: 3
BEST TRANS-GENERATION
01011001,  89, 0.60, 0.33 (0.43)
*********************************************
P 0: 01011001,  89, 0.60, 0.33, (0.43)
P 1: 01011010,  90, 0.67, 0.33, (0.32)
P 2: 01011010,  90, 0.67, 0.33, (0.32)
P 3: 01011010,  90, 0.67, 0.33, (0.30)
P 4: 01010110,  86, 0.40, 0.33, (0.24)
P 5: 11010110, 214, 0.40, 0.87, (-0.15)
---------------------------------------------
T 0: 01011001,  89, 0.60, 0.33, (0.44)
T 1: 01011001,  89, 0.60, 0.33, (0.44)
T 2: 01011011,  91, 0.73, 0.33, (0.21)
T 3: 01011011,  91, 0.73, 0.33, (0.20)
T 4: 01011001,  89, 0.60, 0.33, (0.44)
T 5: 00011011,  27, 0.73, 0.07, (0.21)
*********************************************

G: 4
BEST TRANS-GENERATION
01011001,  89, 0.60, 0.33 (0.44)
*********************************************
P 0: 01011001,  89, 0.60, 0.33, (0.44)
P 1: 01011001,  89, 0.60, 0.33, (0.44)
P 2: 01011001,  89, 0.60, 0.33, (0.44)
P 3: 00011011,  27, 0.73, 0.07, (0.21)
P 4: 01011011,  91, 0.73, 0.33, (0.21)
P 5: 01011011,  91, 0.73, 0.33, (0.20)
---------------------------------------------
T 0: 01011001,  89, 0.60, 0.33, (0.42)
T 1: 11011001, 217, 0.60, 0.87, (-0.02)
T 2: 01011001,  89, 0.60, 0.33, (0.45)
T 3: 01010001,  81, 0.07, 0.33, (-0.13)
T 4: 01011001,  89, 0.60, 0.33, (0.43)
T 5: 01011001,  89, 0.60, 0.33, (0.43)
*********************************************

G: 5
BEST TRANS-GENERATION
01011001,  89, 0.60, 0.33 (0.45)
*********************************************
P 0: 01011001,  89, 0.60, 0.33, (0.45)
P 1: 01011001,  89, 0.60, 0.33, (0.43)
P 2: 01011001,  89, 0.60, 0.33, (0.43)
P 3: 01011001,  89, 0.60, 0.33, (0.42)
P 4: 11011001, 217, 0.60, 0.87, (-0.02)
P 5: 01010001,  81, 0.07, 0.33, (-0.13)
---------------------------------------------
T 0: 01011001,  89, 0.60, 0.33, (0.44)
T 1: 01011001,  89, 0.60, 0.33, (0.44)
T 2: 01011001,  89, 0.60, 0.33, (0.42)
T 3: 01011001,  89, 0.60, 0.33, (0.44)
T 4: 01011001,  89, 0.60, 0.33, (0.45)
T 5: 01011001,  89, 0.60, 0.33, (0.44)
*********************************************

G: 6
BEST TRANS-GENERATION
01011001,  89, 0.60, 0.33 (0.45)
*********************************************
P 0: 01011001,  89, 0.60, 0.33, (0.45)
P 1: 01011001,  89, 0.60, 0.33, (0.44)
P 2: 01011001,  89, 0.60, 0.33, (0.44)
P 3: 01011001,  89, 0.60, 0.33, (0.44)
P 4: 01011001,  89, 0.60, 0.33, (0.44)
P 5: 01011001,  89, 0.60, 0.33, (0.42)
---------------------------------------------
T 0: 01011001,  89, 0.60, 0.33, (0.44)
T 1: 01011001,  89, 0.60, 0.33, (0.45)
T 2: 01011001,  89, 0.60, 0.33, (0.42)
T 3: 01011001,  89, 0.60, 0.33, (0.44)
T 4: 01011001,  89, 0.60, 0.33, (0.44)
T 5: 01001001,  73, 0.60, 0.27, (0.51)
*********************************************

G: 7
BEST TRANS-GENERATION
01001001,  73, 0.60, 0.27 (0.51)
*********************************************
P 0: 01001001,  73, 0.60, 0.27, (0.51)
P 1: 01011001,  89, 0.60, 0.33, (0.45)
P 2: 01011001,  89, 0.60, 0.33, (0.44)
P 3: 01011001,  89, 0.60, 0.33, (0.44)
P 4: 01011001,  89, 0.60, 0.33, (0.44)
P 5: 01011001,  89, 0.60, 0.33, (0.42)
---------------------------------------------
T 0: 01011001,  89, 0.60, 0.33, (0.42)
T 1: 01011001,  89, 0.60, 0.33, (0.43)
T 2: 01011001,  89, 0.60, 0.33, (0.43)
T 3: 01011001,  89, 0.60, 0.33, (0.42)
T 4: 01011001,  89, 0.60, 0.33, (0.41)
T 5: 01011001,  89, 0.60, 0.33, (0.43)
*********************************************

G: 8
BEST TRANS-GENERATION
01001001,  73, 0.60, 0.27 (0.51)
*********************************************
P 0: 01011001,  89, 0.60, 0.33, (0.43)
P 1: 01011001,  89, 0.60, 0.33, (0.43)
P 2: 01011001,  89, 0.60, 0.33, (0.43)
P 3: 01011001,  89, 0.60, 0.33, (0.42)
P 4: 01011001,  89, 0.60, 0.33, (0.42)
P 5: 01011001,  89, 0.60, 0.33, (0.41)
---------------------------------------------
T 0: 01011001,  89, 0.60, 0.33, (0.41)
T 1: 01011001,  89, 0.60, 0.33, (0.43)
T 2: 01011001,  89, 0.60, 0.33, (0.44)
T 3: 01011001,  89, 0.60, 0.33, (0.44)
T 4: 01011001,  89, 0.60, 0.33, 
nsh> [Kflapping stop
flapping: exiting.
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 11000011, 195, 0.20, 0.80, (-100000.0000000)
P 1: 10010110, 150, 0.40, 0.60, (-100000.0000000)
P 2: 00101111,  47, 1.00, 0.13, (-100000.0000000)
P 3: 11101111, 239, 1.00, 0.93, (-100000.0000000)
P 4: 00100110,  38, 0.40, 0.13, (-100000.0000000)
P 5: 00111110,  62, 0.93, 0.20, (-100000.0000000)
---------------------------------------------
nsh> [K(-0.41)
T 1: 10010110, 150, 0.40, 0.60, (0.04)
T 2: 00101111,  47, 1.00, 0.13, (-0.40)
T 3: 11101111, 239, 1.00, 0.93, (0.09)
T 4: 00100110,  38, 0.40, 0.13, (0.38)
T 5: 00111110,  62, 0.93, 0.20, (-0.31)
*********************************************

G: 1
BEST TRANS-GENERATION
00100110,  38, 0.40, 0.13 (0.38)
*********************************************
P 0: 00100110,  38, 0.40, 0.13, (0.38)
P 1: 11101111, 239, 1.00, 0.93, (0.09)
P 2: 10010110, 150, 0.40, 0.60, (0.04)
P 3: 00111110,  62, 0.93, 0.20, (-0.31)
P 4: 00101111,  47, 1.00, 0.13, (-0.40)
P 5: 11000011, 195, 0.20, 0.80, (-0.41)
---------------------------------------------
T 0: 11100110, 230, 0.40, 0.93, (-0.20)
T 1: 11101111, 239, 1.00, 0.93, (0.10)
T 2: 11101111, 239, 1.00, 0.93, (0.10)
T 3: 11101111, 239, 1.00, 0.93, (0.10)
T 4: 00100111,  39, 0.47, 0.13, (0.40)
T 5: 00100111,  39, 0.47, 0.13, (0.41)
*********************************************

G: 2
BEST TRANS-GENERATION
00100111,  39, 0.47, 0.13 (0.41)
*********************************************
P 0: 00100111,  39, 0.47, 0.13, (0.41)
P 1: 00100111,  39, 0.47, 0.13, (0.40)
P 2: 11101111, 239, 1.00, 0.93, (0.10)
P 3: 11101111, 239, 1.00, 0.93, (0.10)
P 4: 11101111, 239, 1.00, 0.93, (0.10)
P 5: 11100110, 230, 0.40, 0.93, (-0.20)
---------------------------------------------
T 0: 11100111, 231, 0.47, 0.93, (-0.16)
T 1: 11100111, 231, 0.47, 0.93, (-0.17)
T 2: 11100111, 231, 0.47, 0.93, (-0.15)
T 3: 11100111, 231, 0.47, 0.93, (-0.16)
T 4: 11100111, 231, 0.47, 0.93, (-0.17)
T 5: 11100111, 231, 0.47, 0.93, (-0.16)
*********************************************

G: 3
BEST TRANS-GENERATION
00100111,  39, 0.47, 0.13 (0.41)
*********************************************
P 0: 11100111, 231, 0.47, 0.93, (-0.15)
P 1: 11100111, 231, 0.47, 0.93, (-0.16)
P 2: 11100111, 231, 0.47, 0.93, (-0.16)
P 3: 11100111, 231, 0.47, 0.93, (-0.16)
P 4: 11100111, 231, 0.47, 0.93, (-0.17)
P 5: 11100111, 231, 0.47, 0.93, (-0.17)
---------------------------------------------
T 0: 11100111, 231, 0.47, 0.93, (-0.16)
T 1: 11101111, 239, 1.00, 0.93, 
nsh> [Kfl(0.09)
T 2: 11101111, 239, 1.00, 0.93, appign stop
nsh: flappign: command not found
nsh> [K(0.09)
T 3: 11100111, 231, 0.47, 0.93, ! 
nsh: !: command not found
nsh> [K
nsh> [K
nsh> [Kreboot -b

nsh> [K
nsh> [K
nsh> [Kflapping stop
nsh> [K
nsh> [K
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (-100000.0000000)
P 1: 01111100, 124, 0.80, 0.47, (-100000.0000000)
P 2: 01001110,  78, 0.93, 0.27, (-100000.0000000)
P 3: 11011000, 216, 0.53, 0.87, (-100000.0000000)
P 4: 00010000,  16, 0.00, 0.07, (-100000.0000000)
P 5: 00101000,  40, 0.53, 0.13, (-100000.0000000)
---------------------------------------------
nsh> [K(-10.72)
T 1: 01111100, 124, 0.80, 0.47, (-9.38)
T 2: 01001110,  78, 0.93, 0.27, (-9.47)
T 3: 11011000, 216, 0.53, 0.87, (-9.09)
T 4: 00010000,  16, 0.00, 0.07, (-13.58)
T 5: 00101000,  40, 0.53, 0.13, flapping stop
nsh> [Kflapping: exiting.

nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 11100111, 231, 0.47, 0.93, (-100000.0000000)
P 1: 00101011,  43, 0.73, 0.13, (-100000.0000000)
P 2: 11101101, 237, 0.87, 0.93, (-100000.0000000)
P 3: 00001001,   9, 0.60, 0.00, (-100000.0000000)
P 4: 11000011, 195, 0.20, 0.80, (-100000.0000000)
P 5: 10100011, 163, 0.20, 0.67, (-100000.0000000)
---------------------------------------------
nsh> [K! 
nsh: !: command not found
nsh> [K
nsh> [K
nsh> [Kreboot -b

nsh> [K
nsh> [Kflapping stop
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (-100000.0000000)
P 1: 01111100, 124, 0.80, 0.47, (-100000.0000000)
P 2: 01001110,  78, 0.93, 0.27, (-100000.0000000)
P 3: 11011000, 216, 0.53, 0.87, (-100000.0000000)
P 4: 00010000,  16, 0.00, 0.07, (-100000.0000000)
P 5: 00101000,  40, 0.53, 0.13, (-100000.0000000)
---------------------------------------------
nsh> [K
nsh> [K(7.54)
T 1: 01111100, 124, 0.80, 0.47, (4.35)
T 2: 01001110,  78, 0.93, 0.27, (3.78)
T 3: 11011000, 216, 0.53, 0.87, (4.62)
T 4: 00010000,  16, 0.00, 0.07, (10.17)
T 5: 00101000,  40, 0.53, 0.13, (6.76)
*********************************************

G: 1
BEST TRANS-GENERATION
00010000,  16, 0.00, 0.07 (10.17)
*********************************************
P 0: 00010000,  16, 0.00, 0.07, (10.17)
P 1: 00000111,   7, 0.47, 0.00, (7.54)
P 2: 00101000,  40, 0.53, 0.13, (6.76)
P 3: 11011000, 216, 0.53, 0.87, (4.62)
P 4: 01111100, 124, 0.80, 0.47, (4.35)
P 5: 01001110,  78, 0.93, 0.27, (3.78)
---------------------------------------------
T 0: 00010000,  16, 0.00, 0.07, (10.15)
T 1: 00101000,  40, 0.53, 0.13, (6.76)
T 2: 00000110,   6, 0.40, 0.00, (8.34)
T 3: 00010000,  16, 0.00, 0.07, (10.40)
T 4: 00000110,   6, 0.40, 0.00, (8.16)
T 5: 00000111,   7, 0.47, 0.00, (7.44)
*********************************************

G: 2
BEST TRANS-GENERATION
00010000,  16, 0.00, 0.07 (10.40)
*********************************************
P 0: 00010000,  16, 0.00, 0.07, (10.40)
P 1: 00010000,  16, 0.00, 0.07, (10.15)
P 2: 00000110,   6, 0.40, 0.00, (8.34)
P 3: 00000110,   6, 0.40, 0.00, (8.16)
P 4: 00000111,   7, 0.47, 0.00, (7.44)
P 5: 00101000,  40, 0.53, 0.13, (6.76)
---------------------------------------------
T 0: 00010000,  16, 0.00, 0.07, (10.28)
T 1: 00010000,  16, 0.00, 0.07, (10.20)
T 2: 00010110,  22, 0.40, 0.07, (7.86)
T 3: 00010000,  16, 0.00, 0.07, (10.26)
T 4: 00010000,  16, 0.00, 0.07, (10.22)
T 5: 00010000,  16, 0.00, 0.07, (10.19)
*********************************************

G: 3
BEST TRANS-GENERATION
00010000,  16, 0.00, 0.07 (10.40)
*********************************************
P 0: 00010000,  16, 0.00, 0.07, (10.28)
P 1: 00010000,  16, 0.00, 0.07, (10.26)
P 2: 00010000,  16, 0.00, 0.07, (10.22)
P 3: 00010000,  16, 0.00, 0.07, (10.20)
P 4: 00010000,  16, 0.00, 0.07, (10.19)
P 5: 00010110,  22, 0.40, 0.07, (7.86)
---------------------------------------------
T 0: 00010000,  16, 0.00, 0.07, (10.22)
T 1: 00010000,  16, 0.00, 0.07, (10.20)
T 2: 00010000,  16, 0.00, 0.07, (10.21)
T 3: 00010000,  16, 0.00, 0.07, (10.15)
T 4: 00010000,  16, 0.00, 0.07, (10.21)
T 5: 00010000,  16, 0.00, 0.07, (10.23)
*********************************************

G: 4
BEST TRANS-GENERATION
00010000,  16, 0.00, 0.07 (10.40)
*********************************************
P 0: 00010000,  16, 0.00, 0.07, (10.23)
P 1: 00010000,  16, 0.00, 0.07, (10.22)
P 2: 00010000,  16, 0.00, 0.07, (10.21)
P 3: 00010000,  16, 0.00, 0.07, (10.21)
P 4: 00010000,  16, 0.00, 0.07, (10.20)
P 5: 00010000,  16, 0.00, 0.07, (10.15)
---------------------------------------------
T 0: 00010000,  16, 0.00, 0.07, (10.20)
T 1: 00010000,  16, 0.00, 0.07, (10.17)
T 2: 00010000,  16, 0.00, 0.07, (10.20)
T 3: 00010000,  16, 0.00, 0.07, (10.21)
T 4: 00010000,  16, 0.00, 0.07, (10.14)
T 5: 00010000,  16, 0.00, 0.07, ! 
nsh: !: command not found
nsh> [K
nsh> [K
nsh> [Kreboot -b

nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [Kro[Kf[K[Kflapping stop
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00000111,   7, 0.47, 0.00, (-100000.0000000)
P 1: 01111100, 124, 0.80, 0.47, (-100000.0000000)
P 2: 01001110,  78, 0.93, 0.27, (-100000.0000000)
P 3: 11011000, 216, 0.53, 0.87, (-100000.0000000)
P 4: 00010000,  16, 0.00, 0.07, (-100000.0000000)
P 5: 00101000,  40, 0.53, 0.13, (-100000.0000000)
---------------------------------------------
nsh> [K(-44.61)
T 1: 01111100, 124, 0.80, 0.47, (-10.86)
T 2: 01001110,  78, 0.93, 0.27, (-12.80)
T 3: 11011000, 216, 0.53, 0.87, (-0.57)
T 4: 00010000,  16, 0.00, 0.07, (-5.03)
T 5: 00101000,  40, 0.53, 0.13, (-38.28)
*********************************************

G: 1
BEST TRANS-GENERATION
11011000, 216, 0.53, 0.87 (-0.57)
*********************************************
P 0: 11011000, 216, 0.53, 0.87, (-0.57)
P 1: 00010000,  16, 0.00, 0.07, (-5.03)
P 2: 01111100, 124, 0.80, 0.47, (-10.86)
P 3: 01001110,  78, 0.93, 0.27, (-12.80)
P 4: 00101000,  40, 0.53, 0.13, (-38.28)
P 5: 00000111,   7, 0.47, 0.00, (-44.61)
---------------------------------------------
T 0: 11011000, 216, 0.53, 0.87, (-2.41)
T 1: 01111100, 124, 0.80, 0.47, (-9.55)
T 2: 00010000,  16, 0.00, 0.07, (-5.67)
T 3: 11011000, 216, 0.53, 0.87, (-1.68)
T 4: 00010000,  16, 0.00, 0.07, (-4.33)
T 5: 10010000, 144, 0.00, 0.60, (-40.74)
*********************************************

G: 2
BEST TRANS-GENERATION
11011000, 216, 0.53, 0.87 (-0.57)
*********************************************
P 0: 11011000, 216, 0.53, 0.87, (-1.68)
P 1: 11011000, 216, 0.53, 0.87, (-2.41)
P 2: 00010000,  16, 0.00, 0.07, (-4.33)
P 3: 00010000,  16, 0.00, 0.07, (-5.67)
P 4: 01111100, 124, 0.80, 0.47, (-9.55)
P 5: 10010000, 144, 0.00, 0.60, (-40.74)
---------------------------------------------
T 0: 11011000, 216, 0.53, 0.87, (-4.62)
T 1: 11011000, 216, 0.53, 0.87, (-4.01)
T 2: 11010000, 208, 0.00, 0.87, (-47.61)
T 3: 11011000, 216, 0.53, 0.87, (-3.49)
T 4: 11011000, 216, 0.53, 0.87, (-2.96)
T 5: 11011000, 216, 0.53, 0.87, (-3.32)
*********************************************

G: 3
BEST TRANS-GENERATION
11011000, 216, 0.53, 0.87 (-0.57)
*********************************************
P 0: 11011000, 216, 0.53, 0.87, (-2.96)
P 1: 11011000, 216, 0.53, 0.87, (-3.32)
P 2: 11011000, 216, 0.53, 0.87, (-3.49)
P 3: 11011000, 216, 0.53, 0.87, (-4.01)
P 4: 11011000, 216, 0.53, 0.87, (-4.62)
P 5: 11010000, 208, 0.00, 0.87, (-47.61)
---------------------------------------------
T 0: 11011000, 216, 0.53, 0.87, (-2.17)
T 1: 11011000, 216, 0.53, 0.87, (-3.19)
T 2: 11011000, 216, 0.53, 0.87, (-3.57)
T 3: 11011000, 216, 0.53, 0.87, (-2.81)
T 4: 11011000, 216, 0.53, 0.87, (-2.33)
T 5: 11011000, 216, 0.53, 0.87, (-1.74)
*********************************************

G: 4
BEST TRANS-GENERATION
11011000, 216, 0.53, 0.87 (-0.57)
*********************************************
P 0: 11011000, 216, 0.53, 0.87, (-1.74)
P 1: 11011000, 216, 0.53, 0.87, (-2.17)
P 2: 11011000, 216, 0.53, 0.87, (-2.33)
P 3: 11011000, 216, 0.53, 0.87, (-2.81)
P 4: 11011000, 216, 0.53, 0.87, (-3.19)
P 5: 11011000, 216, 0.53, 0.87, (-3.57)
---------------------------------------------
T 0: 11011000, 216, 0.53, 0.87, (-1.54)
T 1: 11011000, 216, 0.53, 0.87, (-2.45)
T 2: 11011000, 216, 0.53, 0.87, (-1.67)
T 3: 11011000, 216, 0.53, 0.87, (-2.77)
T 4: 11011000, 216, 0.53, 0.87, (-2.34)
T 5: 11011000, 216, 0.53, 0.87, (-2.80)
*********************************************

G: 5
BEST TRANS-GENERATION
11011000, 216, 0.53, 0.87 (-0.57)
*********************************************
P 0: 11011000, 216, 0.53, 0.87, (-1.54)
P 1: 11011000, 216, 0.53, 0.87, (-1.67)
P 2: 11011000, 216, 0.53, 0.87, (-2.34)
P 3: 11011000, 216, 0.53, 0.87, (-2.45)
P 4: 11011000, 216, 0.53, 0.87, (-2.77)
P 5: 11011000, 216, 0.53, 0.87, (-2.80)
---------------------------------------------
T 0: 11011000, 216, 0.53, 0.87, 
nsh> [Kflapping wing [K[K[K[K[Kstop
flapping: exiting.
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 10001011, 139, 0.73, 0.53, (-100000.0000000)
P 1: 01110111, 119, 0.47, 0.47, (-100000.0000000)
P 2: 11011001, 217, 0.60, 0.87, (-100000.0000000)
P 3: 10111100, 188, 0.80, 0.73, (-100000.0000000)
P 4: 00000101,   5, 0.33, 0.00, (-100000.0000000)
P 5: 00010001,  17, 0.07, 0.07, (-100000.0000000)
---------------------------------------------
nsh> [K(-11.73)
T 1: 01110111, 119, 0.47, 0.47, (-4.65)
T 2: 11011001, 217, 0.60, 0.87, (-1.19)
T 3: 10111100, 188, 0.80, 0.73, (-8.74)
T 4: 00000101,   5, 0.33, 0.00, (-39.22)
T 5: 00010001,  17, 0.07, 0.07, (-7.35)
*********************************************

G: 1
BEST TRANS-GENERATION
11011001, 217, 0.60, 0.87 (-1.19)
*********************************************
P 0: 11011001, 217, 0.60, 0.87, (-1.19)
P 1: 01110111, 119, 0.47, 0.47, (-4.65)
P 2: 00010001,  17, 0.07, 0.07, (-7.35)
P 3: 10111100, 188, 0.80, 0.73, (-8.74)
P 4: 10001011, 139, 0.73, 0.53, (-11.73)
P 5: 00000101,   5, 0.33, 0.00, (-39.22)
---------------------------------------------
T 0: 11011001, 217, 0.60, 0.87, (-1.51)
T 1: 11011000, 216, 0.53, 0.87, (0.62)
T 2: 01111001, 121, 0.60, 0.47, (-3.09)
T 3: 11011001, 217, 0.60, 0.87, (0.94)
T 4: 11010001, 209, 0.07, 0.87, (-45.61)
T 5: 00010001,  17, 0.07, 0.07, (-5.45)
*********************************************

G: 2
BEST TRANS-GENERATION
11011001, 217, 0.60, 0.87 (0.94)
*********************************************
P 0: 11011001, 217, 0.60, 0.87, (0.94)
P 1: 11011000, 216, 0.53, 0.87, (0.62)
P 2: 11011001, 217, 0.60, 0.87, (-1.51)
P 3: 01111001, 121, 0.60, 0.47, (-3.09)
P 4: 00010001,  17, 0.07, 0.07, (-5.45)
P 5: 11010001, 209, 0.07, 0.87, (-45.61)
---------------------------------------------
T 0: 11011001, 217, 0.60, 0.87, (-0.50)
T 1: 11011001, 217, 0.60, 0.87, (-2.39)
T 2: 11011001, 217, 0.60, 0.87, (-0.75)
T 3: 11011001, 217, 0.60, 0.87, (-0.61)
T 4: 11011001, 217, 0.60, 0.87, (-0.78)
T 5: 11011001, 217, 0.60, 0.87, (-0.06)
*********************************************

G: 3
BEST TRANS-GENERATION
11011001, 217, 0.60, 0.87 (0.94)
*********************************************
P 0: 11011001, 217, 0.60, 0.87, (-0.06)
P 1: 11011001, 217, 0.60, 0.87, (-0.50)
P 2: 11011001, 217, 0.60, 0.87, (-0.61)
P 3: 11011001, 217, 0.60, 0.87, (-0.75)
P 4: 11011001, 217, 0.60, 0.87, (-0.78)
P 5: 11011001, 217, 0.60, 0.87, (-2.39)
---------------------------------------------
T 0: 11011001, 217, 0.60, 0.87, (0.08)
T 1: 11011001, 217, 0.60, 0.87, (0.88)
T 2: 11011001, 217, 0.60, 0.87, (-0.24)
T 3: 11011001, 217, 0.60, 0.87, (0.94)
T 4: 11011001, 217, 0.60, 0.87, (0.28)
T 5: 11011001, 217, 0.60, 0.87, (-0.18)
*********************************************

G: 4
BEST TRANS-GENERATION
11011001, 217, 0.60, 0.87 (0.94)
*********************************************
P 0: 11011001, 217, 0.60, 0.87, (0.94)
P 1: 11011001, 217, 0.60, 0.87, (0.88)
P 2: 11011001, 217, 0.60, 0.87, (0.28)
P 3: 11011001, 217, 0.60, 0.87, (0.08)
P 4: 11011001, 217, 0.60, 0.87, (-0.18)
P 5: 11011001, 217, 0.60, 0.87, (-0.24)
---------------------------------------------
T 0: 11011001, 217, 0.60, 0.87, 
nsh> [Kflapping stop
flapping: exiting.
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 11010111, 215, 0.47, 0.87, (-100000.0000000)
P 1: 01010110,  86, 0.40, 0.33, (-100000.0000000)
P 2: 10101110, 174, 0.93, 0.67, (-100000.0000000)
P 3: 01010100,  84, 0.27, 0.33, (-100000.0000000)
P 4: 00010001,  17, 0.07, 0.07, (-100000.0000000)
P 5: 00010111,  23, 0.47, 0.07, (-100000.0000000)
---------------------------------------------
nsh> [K(-2.18)
T 1: 01010110,  86, 0.40, 0.33, (-15.44)
T 2: 10101110, 174, 0.93, 0.67, (-16.76)
T 3: 01010100,  84, 0.27, 0.33, (-17.38)
T 4: 00010001,  17, 0.07, 0.07, (-9.06)
T 5: 00010111,  23, 0.47, 0.07, (-44.68)
*********************************************

G: 1
BEST TRANS-GENERATION
11010111, 215, 0.47, 0.87 (-2.18)
*********************************************
P 0: 11010111, 215, 0.47, 0.87, (-2.18)
P 1: 00010001,  17, 0.07, 0.07, (-9.06)
P 2: 01010110,  86, 0.40, 0.33, (-15.44)
P 3: 10101110, 174, 0.93, 0.67, (-16.76)
P 4: 01010100,  84, 0.27, 0.33, (-17.38)
P 5: 00010111,  23, 0.47, 0.07, (-44.68)
---------------------------------------------
T 0: 11010111, 215, 0.47, 0.87, (-11.69)
T 1: 01010111,  87, 0.47, 0.33, (-18.76)
T 2: 00010111,  23, 0.47, 0.07, (-46.53)
T 3: 11010111, 215, 0.47, 0.87, (-18.81)
T 4: 01010110,  86, 0.40, 0.33, (-19.60)
T 5: 01010100,  84, 0.27, 0.33, (-21.86)
*********************************************

G: 2
BEST TRANS-GENERATION
11010111, 215, 0.47, 0.87 (-2.18)
*********************************************
P 0: 11010111, 215, 0.47, 0.87, (-11.69)
P 1: 01010111,  87, 0.47, 0.33, (-18.76)
P 2: 11010111, 215, 0.47, 0.87, (-18.81)
P 3: 01010110,  86, 0.40, 0.33, (-19.60)
P 4: 01010100,  84, 0.27, 0.33, (-21.86)
P 5: 00010111,  23, 0.47, 0.07, (-46.53)
---------------------------------------------
T 0: 11010111, 215, 0.47, 0.87, (-3.32)
T 1: 01010111,  87, 0.47, 0.33, (-18.84)
T 2: 11010111, 215, 0.47, 0.87, (-3.37)
T 3: 11010111, 215, 0.47, 0.87, (-1.96)
T 4: 01010111,  87, 0.47, 0.33, (-18.22)
T 5: 11010111, 215, 0.47, 0.87, (-1.70)
*********************************************

G: 3
BEST TRANS-GENERATION
11010111, 215, 0.47, 0.87 (-1.70)
*********************************************
P 0: 11010111, 215, 0.47, 0.87, (-1.70)
P 1: 11010111, 215, 0.47, 0.87, (-1.96)
P 2: 11010111, 215, 0.47, 0.87, (-3.32)
P 3: 11010111, 215, 0.47, 0.87, (-3.37)
P 4: 01010111,  87, 0.47, 0.33, (-18.22)
P 5: 01010111,  87, 0.47, 0.33, (-18.84)
---------------------------------------------
T 0: 11010111, 215, 0.47, 0.87, (-2.75)
T 1: 11010111, 215, 0.47, 0.87, (-1.64)
T 2: 11010111, 215, 0.47, 0.87, (-3.48)
T 3: 11010111, 215, 0.47, 0.87, (-0.06)
T 4: 11010111, 215, 0.47, 0.87, (-2.11)
T 5: 11010110, 214, 0.40, 0.87, (-7.48)
*********************************************

G: 4
BEST TRANS-GENERATION
11010111, 215, 0.47, 0.87 (-0.06)
*********************************************
P 0: 11010111, 215, 0.47, 0.87, (-0.06)
P 1: 11010111, 215, 0.47, 0.87, (-1.64)
P 2: 11010111, 215, 0.47, 0.87, (-2.11)
P 3: 11010111, 215, 0.47, 0.87, (-2.75)
P 4: 11010111, 215, 0.47, 0.87, (-3.48)
P 5: 11010110, 214, 0.40, 0.87, (-7.48)
---------------------------------------------
T 0: 11010111, 215, 0.47, 0.87, (-1.07)
T 1: 11010111, 215, 0.47, 0.87, (-2.43)
T 2: 11010101, 213, 0.33, 0.87, (-14.51)
T 3: 11010101, 213, 0.33, 0.87, (-15.17)
T 4: 11010111, 215, 0.47, 0.87, (-3.53)
T 5: 11010101, 213, 0.33, 0.87, (-14.55)
*********************************************

G: 5
BEST TRANS-GENERATION
11010111, 215, 0.47, 0.87 (-0.06)
*********************************************
P 0: 11010111, 215, 0.47, 0.87, (-1.07)
P 1: 11010111, 215, 0.47, 0.87, (-2.43)
P 2: 11010111, 215, 0.47, 0.87, (-3.53)
P 3: 11010101, 213, 0.33, 0.87, (-14.51)
P 4: 11010101, 213, 0.33, 0.87, (-14.55)
P 5: 11010101, 213, 0.33, 0.87, (-15.17)
---------------------------------------------
T 0: 11010111, 215, 0.47, 0.87, (-3.43)
T 1: 11010111, 215, 0.47, 0.87, (-2.78)
T 2: 11010111, 215, 0.47, 0.87, (-4.25)
T 3: 11010111, 215, 0.47, 0.87, (-1.54)
T 4: 11010111, 215, 0.47, 0.87, (-2.36)
T 5: 11010111, 215, 0.47, 0.87, (-3.35)
*********************************************

G: 6
BEST TRANS-GENERATION
11010111, 215, 0.47, 0.87 (-0.06)
*********************************************
P 0: 11010111, 215, 0.47, 0.87, (-1.54)
P 1: 11010111, 215, 0.47, 0.87, (-2.36)
P 2: 11010111, 215, 0.47, 0.87, (-2.78)
P 3: 11010111, 215, 0.47, 0.87, (-3.35)
P 4: 11010111, 215, 0.47, 0.87, (-3.43)
P 5: 11010111, 215, 0.47, 0.87, (-4.25)
---------------------------------------------
T 0: 11010111, 215, 0.47, 0.87, (-2.27)
T 1: 11010111, 215, 0.47, 0.87, (-1.32)
T 2: 11010111, 215, 0.47, 0.87, (-2.88)
T 3: 11010011, 211, 0.20, 0.87, 
nsh> [Kflap(-29.79)
T 4: 11010111, 215, 0.47, 0.87, p(-3.73)
T 5: 11010111, 215, 0.47, 0.87, 
nsh: flapp: command not found
nsh> [Kflapping stop
nsh> flapping: exiting.
[K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [K
nsh> [Kflapping start
flapping: starting
error finding param: FL_K_OMEGA
*********************************************

G: 0
BEST TRANS-GENERATION
00000000,   0, 0.00, 0.00 (-100000.0000000)
*********************************************
P 0: 00101011,  43, 0.73, 0.13, (-100000.0000000)
P 1: 01000100,  68, 0.27, 0.27, (-100000.0000000)
P 2: 00010111,  23, 0.47, 0.07, (-100000.0000000)
P 3: 11110010, 242, 0.13, 1.00, (-100000.0000000)
P 4: 10111100, 188, 0.80, 0.73, (-100000.0000000)
P 5: 10111001, 185, 0.60, 0.73, (-100000.0000000)
---------------------------------------------
nsh> [K(-27.42)
T 1: 01000100,  68, 0.27, 0.27, (-28.78)
T 2: 00010111,  23, 0.47, 0.07, (-42.61)
T 3: 11110010, 242, 0.13, 1.00, (-42.22)
T 4: 10111100, 188, 0.80, 0.73, (-11.51)
T 5: 10111001, 185, 0.60, 0.73, (-7.90)
*********************************************

G: 1
BEST TRANS-GENERATION
10111001, 185, 0.60, 0.73 (-7.90)
*********************************************
P 0: 10111001, 185, 0.60, 0.73, (-7.90)
P 1: 10111100, 188, 0.80, 0.73, (-11.51)
P 2: 00101011,  43, 0.73, 0.13, (-27.42)
P 3: 01000100,  68, 0.27, 0.27, (-28.78)
P 4: 11110010, 242, 0.13, 1.00, (-42.22)
P 5: 00010111,  23, 0.47, 0.07, (-42.61)
---------------------------------------------
T 0: 10111001, 185, 0.60, 0.73, (-1.54)
T 1: 00101011,  43, 0.73, 0.13, (-28.63)
T 2: 00110001,  49, 0.07, 0.20, (-1.21)
T 3: 10111100, 188, 0.80, 0.73, (-10.88)
T 4: 10111001, 185, 0.60, 0.73, 
nsh> [K(-1.10)
T 5: 10101011, 171, 0.73, 0.67, flap(-9.70)
*********************************************

G: 2
BEST TRANS-GENERATION
10111001, 185, 0.60, 0.73 (-1.10)
*********************************************
P 0: 10111001, 185, 0.60, 0.73, (-1.10)
P 1: 00110001,  49, 0.07, 0.20, (-1.21)
P 2: 10111001, 185, 0.60, 0.73, (-1.54)
P 3: 10101011, 171, 0.73, 0.67, (-9.70)
P 4: 10111100, 188, 0.80, 0.73, (-10.88)
P 5: 00101011,  43, 0.73, 0.13, (-28.63)
---------------------------------------------
T 0: 10111001, 185, 0.60, 0.73, [K[K[K[K
nsh> [Kflapping stop
flapping: exiting.
nsh> [Kreboot
[K